week12/presentation.org
#+TITLE: CMPUT201W20B2 Week 12
#+PROPERTY: header-args:C             :exports both :eval yes :flags -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 :eval yes :results value verbatim
#+PROPERTY: header-args:sh            :exports both :eval yes :results value verbatim
#+PROPERTY: header-args:shell         :exports both :eval yes :results value verbatim

* Week12
https://github.com/abramhindle/CMPUT201W20B2-public/tree/master/week12
** Copyright Statement

If you are in CMPUT201 at UAlberta this code is released in the public
domain to you.

Otherwise it is (c) 2020 Abram Hindle, Hazel Campbell AGPL3.0+

*** License

    CMPUT 201 C Notes
    Copyright (C) 2020 Abram Hindle, Hazel Campbell

    This program is free software: you can redistribute it and/or modify
    it under the terms of the GNU Affero General Public License as
    published by the Free Software Foundation, either version 3 of the
    License, or (at your option) any later version.

    This program is distributed in the hope that it will be useful,
    but WITHOUT ANY WARRANTY; without even the implied warranty of
    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
    GNU Affero General Public License for more details.

    You should have received a copy of the GNU Affero General Public License
    along with this program.  If not, see <https://www.gnu.org/licenses/>.


*** Hazel Code is licensed under AGPL3.0+

Hazel's code is also found here
https://github.com/hazelybell/examples/tree/C-2020-01

Hazel code is licensed: The example code is licensed under the AGPL3+
license, unless otherwise noted.

** Alternative version

Checkout the .txt, the .pdf, and the .html version

** Init ORG-MODE

#+BEGIN_SRC elisp
;; I need this for org-mode to work well
;; If we have a new org-mode use ob-shell
;; otherwise use ob-sh --- but not both!
(if (require 'ob-shell nil 'noerror)
  (progn
    (org-babel-do-load-languages 'org-babel-load-languages '((shell . t))))
  (progn
    (require 'ob-sh)
    (org-babel-do-load-languages 'org-babel-load-languages '((sh . t)))))
(org-babel-do-load-languages 'org-babel-load-languages '((C . t)))
(org-babel-do-load-languages 'org-babel-load-languages '((python . t)))
(setq org-src-fontify-natively t)
(setq org-confirm-babel-evaluate nil) ;; danger!
(custom-set-faces
 '(org-block ((t (:inherit shadow :foreground "black"))))
 '(org-code ((t (:inherit shadow :foreground "black")))))
#+END_SRC

#+RESULTS:

*** Org export
#+BEGIN_SRC elisp
(org-html-export-to-html)
(org-latex-export-to-pdf)
(org-ascii-export-to-ascii)
#+END_SRC

#+RESULTS:
: presentation.txt


*** Org Template
Copy and paste this to demo C

#+BEGIN_SRC C :exports both
#include <stdio.h>

int main(int argc, char**argv) {
    return 0;
}
#+END_SRC

#+RESULTS:

** Remember how to compile?

gcc  -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 -o programname programname.c

** Numbers!

Computers love powers of 2 because we calculate everything via bits.

Bases used on computers:

2, 8, 10, 16

- 32 in base 16 is  2*pow(16,1) = 0x20 
- 32 in base 10 is  3*pow(10,1) + 2*pow(10,0) = 3*10 + 2*1 = 32
- 32 in base 8 is   4*pow(8,1) = 4*8 = 32 = 040
- 32 in base 2 is   1*pow(2,5) = 0b100000

- 31 in base 16 is  1*pow(16,1) + 15*pow(16,0)
- 31 in base 10 is  3*pow(10,1) + 1*pow(10,0)
- 31 in base 8 is   3*pow(8,1) + 7*pow(8,0)
- 31 in base 2 is   1*pow(2,4) + 1*pow(2,3) + 1*pow(2,2) + 1*pow(2,1) + 1*pow(2,0)

- Notation for base 2 for 31:  0b11111 # not available in C, good in python
- Notation for base 8 for 31:  037     # available in C    , good in python
- Notation for base 10 for 31: 31      # available in C    , good in python
- Notation for base 16 for 31: 0x1F    # available in C    , good in python

*** Binary

#+begin_example    
    Base 2: powers of 2
    
    Digits: 0,1
    
    0:  0b00000  8:  0b01000
    1:  0b00001  9:  0b01001 
    2:  0b00010 10:  0b01010 
    3:  0b00011 11:  0b01011 
    4:  0b00100 12:  0b01100
    5:  0b00101 13:  0b01101
    6:  0b00110 14:  0b01110         
    7:  0b00111 15:  0b01111
                16:  0b10000
#+end_example

*** Octal

#+begin_src C 
#include <stdio.h>

int main() {
   printf("%d\n", 037);
}
#+end_src

#+RESULTS:
: 31

#+begin_example    
    Base 8: powers of 8
    
    3 bits
    
    Digits: 0,1,2,3,4,5,6,7
    
    0:  000  8: 010
    1:  001  9: 011   
    2:  002 10: 012   
    3:  003 11: 013   
    4:  004 12: 014  
    5:  005 13: 015  
    6:  006 14: 016           
    7:  007 15: 017  
            16: 020
    
    07:                            7 =   7
    077:                     7*8 + 7 =  63
    0777:            7*8*8 + 7*8 + 7 = 511
    07777: 7*8*8*8 + 7*8*8 + 7*8 + 7 = 4095
#+end_example

