week12/presentation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-04-02 Thu 11:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CMPUT201W20B2 Week 12</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Abram Hindle" />
</head>
<body>
<div id="content">
<h1 class="title">CMPUT201W20B2 Week 12</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb8f7e40">1. Week12</a>
<ul>
<li><a href="#org3b3ae76">1.1. Copyright Statement</a>
<ul>
<li><a href="#orgcb68c08">1.1.1. License</a></li>
<li><a href="#org6cf6ec6">1.1.2. Hazel Code is licensed under AGPL3.0+</a></li>
</ul>
</li>
<li><a href="#org6f0e2a7">1.2. Alternative version</a></li>
<li><a href="#org6296ce0">1.3. Init ORG-MODE</a>
<ul>
<li><a href="#org7a921e7">1.3.1. Org export</a></li>
<li><a href="#org8c0d0e0">1.3.2. Org Template</a></li>
</ul>
</li>
<li><a href="#org6233cef">1.4. Remember how to compile?</a></li>
<li><a href="#org98e2b72">1.5. Numbers!</a>
<ul>
<li><a href="#org6599483">1.5.1. Binary</a></li>
<li><a href="#org633b006">1.5.2. Octal</a></li>
<li><a href="#org55b77fc">1.5.3. Base10 Review</a></li>
<li><a href="#org60224f4">1.5.4. Hex Review</a></li>
</ul>
</li>
<li><a href="#org0aead2a">1.6. Floating Point Numbers</a>
<ul>
<li><a href="#org97021f5">1.6.1. Resources</a></li>
<li><a href="#org0b8a301">1.6.2. Single precision IEEE754 floating point numbers</a></li>
<li><a href="#org5dd151a">1.6.3. Let's explore the bits of floats</a></li>
<li><a href="#org6d3557f">1.6.4. How do I avoid typepunning?</a></li>
</ul>
</li>
<li><a href="#org00fb701">1.7. Modules</a></li>
<li><a href="#org3573c9a">1.8. Coupling</a>
<ul>
<li><a href="#orge147e27">1.8.1. Coupling</a></li>
<li><a href="#org4273518">1.8.2. Graph Coupling</a></li>
</ul>
</li>
<li><a href="#org5d42a70">1.9. Cohesion</a>
<ul>
<li><a href="#orgb222758">1.9.1. McCabe's Cyclometic Complexity</a></li>
<li><a href="#orga0f69a0">1.9.2. Refs</a></li>
</ul>
</li>
<li><a href="#org538a79d">1.10. Big Programs</a>
<ul>
<li><a href="#orge47eeab">1.10.1. DOOM</a></li>
<li><a href="#org264d649">1.10.2. License</a></li>
<li><a href="#org944ceae">1.10.3. Discussion</a></li>
<li><a href="#orgcd4b5d5">1.10.4. Refs</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgb8f7e40" class="outline-2">
<h2 id="orgb8f7e40"><span class="section-number-2">1</span> Week12</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://github.com/abramhindle/CMPUT201W20B2-public/tree/master/week12">https://github.com/abramhindle/CMPUT201W20B2-public/tree/master/week12</a>
</p>
</div>
<div id="outline-container-org3b3ae76" class="outline-3">
<h3 id="org3b3ae76"><span class="section-number-3">1.1</span> Copyright Statement</h3>
<div class="outline-text-3" id="text-1-1">
<p>
If you are in CMPUT201 at UAlberta this code is released in the public
domain to you.
</p>

<p>
Otherwise it is (c) 2020 Abram Hindle, Hazel Campbell AGPL3.0+
</p>
</div>

<div id="outline-container-orgcb68c08" class="outline-4">
<h4 id="orgcb68c08"><span class="section-number-4">1.1.1</span> License</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
CMPUT 201 C Notes
Copyright (C) 2020 Abram Hindle, Hazel Campbell
</p>

<p>
This program is free software: you can redistribute it and/or modify
it under the terms of the GNU Affero General Public License as
published by the Free Software Foundation, either version 3 of the
License, or (at your option) any later version.
</p>

<p>
This program is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
GNU Affero General Public License for more details.
</p>

<p>
You should have received a copy of the GNU Affero General Public License
along with this program.  If not, see <a href="https://www.gnu.org/licenses/">https://www.gnu.org/licenses/</a>.
</p>
</div>
</div>


<div id="outline-container-org6cf6ec6" class="outline-4">
<h4 id="org6cf6ec6"><span class="section-number-4">1.1.2</span> Hazel Code is licensed under AGPL3.0+</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Hazel's code is also found here
<a href="https://github.com/hazelybell/examples/tree/C-2020-01">https://github.com/hazelybell/examples/tree/C-2020-01</a>
</p>

<p>
Hazel code is licensed: The example code is licensed under the AGPL3+
license, unless otherwise noted.
</p>
</div>
</div>
</div>

<div id="outline-container-org6f0e2a7" class="outline-3">
<h3 id="org6f0e2a7"><span class="section-number-3">1.2</span> Alternative version</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Checkout the .txt, the .pdf, and the .html version
</p>
</div>
</div>

<div id="outline-container-org6296ce0" class="outline-3">
<h3 id="org6296ce0"><span class="section-number-3">1.3</span> Init ORG-MODE</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">I need this for org-mode to work well</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">If we have a new org-mode use ob-shell</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">otherwise use ob-sh --- but not both!</span>
(<span style="color: #a020f0;">if</span> (<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">ob-shell</span> nil 'noerror)
  (<span style="color: #a020f0;">progn</span>
    (org-babel-do-load-languages 'org-babel-load-languages '((shell . t))))
  (<span style="color: #a020f0;">progn</span>
    (<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">ob-sh</span>)
    (org-babel-do-load-languages 'org-babel-load-languages '((sh . t)))))
(org-babel-do-load-languages 'org-babel-load-languages '((C . t)))
(org-babel-do-load-languages 'org-babel-load-languages '((python . t)))
(<span style="color: #a020f0;">setq</span> org-src-fontify-natively t)
(<span style="color: #a020f0;">setq</span> org-confirm-babel-evaluate nil) <span style="color: #b22222;">;; </span><span style="color: #b22222;">danger!</span>
(custom-set-faces
 '(org-block ((t (<span style="color: #483d8b;">:inherit</span> shadow <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"black"</span>))))
 '(org-code ((t (<span style="color: #483d8b;">:inherit</span> shadow <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"black"</span>)))))
</pre>
</div>
</div>

<div id="outline-container-org7a921e7" class="outline-4">
<h4 id="org7a921e7"><span class="section-number-4">1.3.1</span> Org export</h4>
<div class="outline-text-4" id="text-1-3-1">
<div class="org-src-container">
<pre class="src src-elisp">(org-html-export-to-html)
(org-latex-export-to-pdf)
(org-ascii-export-to-ascii)
</pre>
</div>
</div>
</div>


<div id="outline-container-org8c0d0e0" class="outline-4">
<h4 id="org8c0d0e0"><span class="section-number-4">1.3.2</span> Org Template</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
Copy and paste this to demo C
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">argc</span>, <span style="color: #228b22;">char</span>**<span style="color: #a0522d;">argv</span>) {
    <span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org6233cef" class="outline-3">
<h3 id="org6233cef"><span class="section-number-3">1.4</span> Remember how to compile?</h3>
<div class="outline-text-3" id="text-1-4">
<p>
gcc  -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 -o programname programname.c
</p>
</div>
</div>

<div id="outline-container-org98e2b72" class="outline-3">
<h3 id="org98e2b72"><span class="section-number-3">1.5</span> Numbers!</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Computers love powers of 2 because we calculate everything via bits.
</p>

<p>
Bases used on computers:
</p>

<p>
2, 8, 10, 16
</p>

<ul class="org-ul">
<li>32 in base 16 is  2*pow(16,1) = 0x20</li>
<li>32 in base 10 is  3*pow(10,1) + 2*pow(10,0) = 3*10 + 2*1 = 32</li>
<li>32 in base 8 is   4*pow(8,1) = 4*8 = 32 = 040</li>
<li>32 in base 2 is   1*pow(2,5) = 0b100000</li>

<li>31 in base 16 is  1*pow(16,1) + 15*pow(16,0)</li>
<li>31 in base 10 is  3*pow(10,1) + 1*pow(10,0)</li>
<li>31 in base 8 is   3*pow(8,1) + 7*pow(8,0)</li>
<li>31 in base 2 is   1*pow(2,4) + 1*pow(2,3) + 1*pow(2,2) + 1*pow(2,1) + 1*pow(2,0)</li>

<li>Notation for base 2 for 31:  0b11111 # not available in C, good in python</li>
<li>Notation for base 8 for 31:  037     # available in C    , good in python</li>
<li>Notation for base 10 for 31: 31      # available in C    , good in python</li>
<li>Notation for base 16 for 31: 0x1F    # available in C    , good in python</li>
</ul>
</div>

<div id="outline-container-org6599483" class="outline-4">
<h4 id="org6599483"><span class="section-number-4">1.5.1</span> Binary</h4>
<div class="outline-text-4" id="text-1-5-1">
<pre class="example">
Base 2: powers of 2

Digits: 0,1

0:  0b00000  8:  0b01000
1:  0b00001  9:  0b01001 
2:  0b00010 10:  0b01010 
3:  0b00011 11:  0b01011 
4:  0b00100 12:  0b01100
5:  0b00101 13:  0b01101
6:  0b00110 14:  0b01110         
7:  0b00111 15:  0b01111
            16:  0b10000
</pre>
</div>
</div>

<div id="outline-container-org633b006" class="outline-4">
<h4 id="org633b006"><span class="section-number-4">1.5.2</span> Octal</h4>
<div class="outline-text-4" id="text-1-5-2">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
   printf(<span style="color: #8b2252;">"%d\n"</span>, 037);
}
</pre>
</div>

<pre class="example">
31
</pre>


<pre class="example">
Base 8: powers of 8

3 bits

Digits: 0,1,2,3,4,5,6,7

0:  000  8: 010
1:  001  9: 011   
2:  002 10: 012   
3:  003 11: 013   
4:  004 12: 014  
5:  005 13: 015  
6:  006 14: 016           
7:  007 15: 017  
        16: 020

07:                            7 =   7
077:                     7*8 + 7 =  63
0777:            7*8*8 + 7*8 + 7 = 511
07777: 7*8*8*8 + 7*8*8 + 7*8 + 7 = 4095
</pre>
</div>
</div>
