week12/presentation.org
*** Base10 Review
#+begin_example
    Base 10: power of 10
    
       Digits: 0,1,2,3,4,5,6,7,8,9
    
    ~4 bits - not a power of 2
    
    0:  0  8:  8
    1:  1  9:  9   
    2:  2 10: 10  
    3:  3 11: 11  
    4:  4 12: 12  
    5:  5 13: 13 
    6:  6 14: 14          
    7:  7 15: 15 
          16: 16
#+end_example
    
*** Hex Review

#+begin_example    
    Base 16: power of 16
    
       Digits: 0,1,2,3,4,5,6,7,8,9,A,B,C,D,E,F
    or Digits: 0,1,2,3,4,5,6,7,8,9,a,b,c,d,e,f
    
    0:  0x00  8: 0x08
    1:  0x01  9: 0x09   
    2:  0x02 10: 0x0A  
    3:  0x03 11: 0x0B   
    4:  0x04 12: 0x0C  
    5:  0x05 13: 0x0D  
    6:  0x06 14: 0x0E           
    7:  0x07 15: 0x0F  
             16: 0x10
    0xF    =                                  15 =    15 = 2^4 - 1
    0xFF   =                          15*16 + 15 =   255 = 2^8 - 1
    0xFFF  =               15*16*16 + 15*16 + 15 =  4095 = 2^12 - 1
    0xFFFF = 15*16*16*16 + 15*16*16 + 15*16 + 15 = 65535 = 2^16 - 1
    
    Digit Lookup
    
    0:  0x0 0b0000     8: 0x8 0b1000
    1:  0x1 0b0001     9: 0x9 0b1001  
    2:  0x2 0b0010    10: 0xA 0b1010 
    3:  0x3 0b0011    11: 0xB 0b1011  
    4:  0x4 0b0100    12: 0xC 0b1100 
    5:  0x5 0b0101    13: 0xD 0b1101 
    6:  0x6 0b0110    14: 0xE 0b1110          
    7:  0x7 0b0111    15: 0xF 0b1111 

    1 nibble = 4 bits = 1 hex digit
#+end_example    

** Floating Point Numbers    

*** Resources

Helpful resources:
- https://en.wikipedia.org/wiki/IEEE_754
- http://steve.hollasch.net/cgindex/coding/ieeefloat.html

*** Single precision IEEE754 floating point numbers

Type: float

Size: 32 bits / 4 bytes

-Sign: 0 - positive, 1 negative
-Exponent: unsigned 8 bit integer with 127 (2^7-1) offset
  -        -126 to 127
  -        1*pow(2,-126) to 1*pow(2,127)
- Fraction: 24 bits (only 23 used). The first bit is implied. 
  - So 00000000000000000000000 is actually 100000000000000000000000
- 0.19e2
- 1.9e1
- 100*0.19 = 19
- b1.11e1
- b0.111e2
- 1.0101e2 = 1*2^2 + 0*2^1 + 1*2^0+ 0*2^-1 + 1*2^-2
           = 4             + 1             + 1/4    = 5.25
- 1.1101e-4 = 1*2^-4 + 1*2^-5 + 1*2^-6 + 1*2-8
            = 1/16  + 1/32  + 1/64 + 1/256
            = 0.11328125
2^-126

#+begin_src C :exports both
#include <stdio.h>
int main() {
    /*printf("%d\n", 0.0F == -0.0F);
    printf("%g\n", 1.0F * -0.0F);
    printf("%0.3f\n", 1.0e+126F * 4.0F);
    printf("%0.3f\n", 1.0e+126F * -4.0F); */
    printf("%e\n", 1.0e38F + 2.0e38F);
    printf("%e\n", 1.0e38F + 4.0e38F);
}
#+end_src

#+RESULTS:
: 3.000000e+38
: inf

: -0.010 = 1*1/100


| Sign (1 bit) | Exponent (8 bit) | b10 |       Fraction (23 bit) |    Value | base 2     |
|            0 |         01111100 |  -3 | 01000000000000000000000 |  0.15625 | 1/8 + 1/32 |
|            1 |         01111100 |  -3 | 01000000000000000000000 | -0.15625 |            |
|            0 |         00000000 |   0 | 00000000000000000000000 |        0 |            |
|            1 |         00000000 |   0 | 00000000000000000000000 |       -0 |            |
|            0 |         11000000 |  65 | 00000000000000000000000 | 3.68e+19 | 2^65       |
|            1 |         11111111 |   0 | 00000000000000000000000 |     -inf |            |
|            0 |         11111111 |   0 | 00000000000000000000000 |      inf |            |
|            0 |         11111111 |   0 | 10000000000000000000000 |      nan |            |
|            0 |         11111111 |   0 | 00000000000000000000001 |      nan |            |

- Neat design trick: you can sort them as signed integers (two's complement)!
- -0 is right before 0 for signed integer sorting

|            0 |         01111100 |  -3 | 01000000000000000000000 |  0.15625 | 1/8 + 1/32 |

0.15625 to floating point. Implied bit is pow(2,-3)

pow(2,-3) + 0*pow(2,-4) + 1*pow(2,-5) (pow(2,5)==32, pow(2,-5) = 1/32.0)

