week12/presentation.html

<div id="outline-container-org55b77fc" class="outline-4">
<h4 id="org55b77fc"><span class="section-number-4">1.5.3</span> Base10 Review</h4>
<div class="outline-text-4" id="text-1-5-3">
<pre class="example">
Base 10: power of 10

   Digits: 0,1,2,3,4,5,6,7,8,9

~4 bits - not a power of 2

0:  0  8:  8
1:  1  9:  9   
2:  2 10: 10  
3:  3 11: 11  
4:  4 12: 12  
5:  5 13: 13 
6:  6 14: 14          
7:  7 15: 15 
      16: 16
</pre>
</div>
</div>

<div id="outline-container-org60224f4" class="outline-4">
<h4 id="org60224f4"><span class="section-number-4">1.5.4</span> Hex Review</h4>
<div class="outline-text-4" id="text-1-5-4">
<pre class="example">
Base 16: power of 16

   Digits: 0,1,2,3,4,5,6,7,8,9,A,B,C,D,E,F
or Digits: 0,1,2,3,4,5,6,7,8,9,a,b,c,d,e,f

0:  0x00  8: 0x08
1:  0x01  9: 0x09   
2:  0x02 10: 0x0A  
3:  0x03 11: 0x0B   
4:  0x04 12: 0x0C  
5:  0x05 13: 0x0D  
6:  0x06 14: 0x0E           
7:  0x07 15: 0x0F  
         16: 0x10
0xF    =                                  15 =    15 = 2^4 - 1
0xFF   =                          15*16 + 15 =   255 = 2^8 - 1
0xFFF  =               15*16*16 + 15*16 + 15 =  4095 = 2^12 - 1
0xFFFF = 15*16*16*16 + 15*16*16 + 15*16 + 15 = 65535 = 2^16 - 1

Digit Lookup

0:  0x0 0b0000     8: 0x8 0b1000
1:  0x1 0b0001     9: 0x9 0b1001  
2:  0x2 0b0010    10: 0xA 0b1010 
3:  0x3 0b0011    11: 0xB 0b1011  
4:  0x4 0b0100    12: 0xC 0b1100 
5:  0x5 0b0101    13: 0xD 0b1101 
6:  0x6 0b0110    14: 0xE 0b1110          
7:  0x7 0b0111    15: 0xF 0b1111 

1 nibble = 4 bits = 1 hex digit
</pre>
</div>
</div>
</div>

<div id="outline-container-org0aead2a" class="outline-3">
<h3 id="org0aead2a"><span class="section-number-3">1.6</span> Floating Point Numbers</h3>
<div class="outline-text-3" id="text-1-6">
</div>
<div id="outline-container-org97021f5" class="outline-4">
<h4 id="org97021f5"><span class="section-number-4">1.6.1</span> Resources</h4>
<div class="outline-text-4" id="text-1-6-1">
<p>
Helpful resources:
</p>
<ul class="org-ul">
<li><a href="https://en.wikipedia.org/wiki/IEEE_754">https://en.wikipedia.org/wiki/IEEE_754</a></li>
<li><a href="http://steve.hollasch.net/cgindex/coding/ieeefloat.html">http://steve.hollasch.net/cgindex/coding/ieeefloat.html</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0b8a301" class="outline-4">
<h4 id="org0b8a301"><span class="section-number-4">1.6.2</span> Single precision IEEE754 floating point numbers</h4>
<div class="outline-text-4" id="text-1-6-2">
<p>
Type: float
</p>

<p>
Size: 32 bits / 4 bytes
</p>

<p>
-Sign: 0 - positive, 1 negative
-Exponent: unsigned 8 bit integer with 127 (2<sup>7</sup>-1) offset
</p>
<ul class="org-ul">
<li>-126 to 127</li>
<li>1*pow(2,-126) to 1*pow(2,127)</li>
</ul>
<ul class="org-ul">
<li>Fraction: 24 bits (only 23 used). The first bit is implied. 
<ul class="org-ul">
<li>So 00000000000000000000000 is actually 100000000000000000000000</li>
</ul></li>
<li>0.19e2</li>
<li>1.9e1</li>
<li>100*0.19 = 19</li>
<li>b1.11e1</li>
<li>b0.111e2</li>
<li>1.0101e2 = 1*2<sup>2</sup> + 0*2<sup>1</sup> + 1*2<sup>0</sup>+ 0*2<sup>-1</sup> + 1*2<sup>-2</sup>
= 4             + 1             + 1/4    = 5.25</li>
<li>1.1101e-4 = 1*2<sup>-4</sup> + 1*2<sup>-5</sup> + 1*2<sup>-6</sup> + 1*2-8
= 1/16  + 1/32  + 1/64 + 1/256
= 0.11328125</li>
</ul>
<p>
2<sup>-126</sup>
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #b22222;">/*</span><span style="color: #b22222;">printf("%d\n", 0.0F == -0.0F);</span>
<span style="color: #b22222;">    printf("%g\n", 1.0F * -0.0F);</span>
<span style="color: #b22222;">    printf("%0.3f\n", 1.0e+126F * 4.0F);</span>
<span style="color: #b22222;">    printf("%0.3f\n", 1.0e+126F * -4.0F); </span><span style="color: #b22222;">*/</span>
    printf(<span style="color: #8b2252;">"%e\n"</span>, 1.0e38F + 2.0e38F);
    printf(<span style="color: #8b2252;">"%e\n"</span>, 1.0e38F + 4.0e38F);
}
</pre>
</div>

<pre class="example">
3.000000e+38
inf
</pre>


<pre class="example">
-0.010 = 1*1/100
</pre>



<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">Sign (1 bit)</td>
<td class="org-right">Exponent (8 bit)</td>
<td class="org-right">b10</td>
<td class="org-right">Fraction (23 bit)</td>
<td class="org-right">Value</td>
<td class="org-left">base 2</td>
</tr>

<tr>
<td class="org-right">0</td>
<td class="org-right">01111100</td>
<td class="org-right">-3</td>
<td class="org-right">01000000000000000000000</td>
<td class="org-right">0.15625</td>
<td class="org-left">1/8 + 1/32</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">01111100</td>
<td class="org-right">-3</td>
<td class="org-right">01000000000000000000000</td>
<td class="org-right">-0.15625</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">0</td>
<td class="org-right">00000000</td>
<td class="org-right">0</td>
<td class="org-right">00000000000000000000000</td>
<td class="org-right">0</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">00000000</td>
<td class="org-right">0</td>
<td class="org-right">00000000000000000000000</td>
<td class="org-right">-0</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">0</td>
<td class="org-right">11000000</td>
<td class="org-right">65</td>
<td class="org-right">00000000000000000000000</td>
<td class="org-right">3.68e+19</td>
<td class="org-left">2<sup>65</sup></td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">11111111</td>
<td class="org-right">0</td>
<td class="org-right">00000000000000000000000</td>
<td class="org-right">-inf</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">0</td>
<td class="org-right">11111111</td>
<td class="org-right">0</td>
<td class="org-right">00000000000000000000000</td>
<td class="org-right">inf</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">0</td>
<td class="org-right">11111111</td>
<td class="org-right">0</td>
<td class="org-right">10000000000000000000000</td>
<td class="org-right">nan</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">0</td>
<td class="org-right">11111111</td>
<td class="org-right">0</td>
<td class="org-right">00000000000000000000001</td>
<td class="org-right">nan</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>Neat design trick: you can sort them as signed integers (two's complement)!</li>
<li>-0 is right before 0 for signed integer sorting</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-right">01111100</td>
<td class="org-right">-3</td>
<td class="org-right">01000000000000000000000</td>
<td class="org-right">0.15625</td>
<td class="org-left">1/8 + 1/32</td>
</tr>
</tbody>
</table>

<p>
0.15625 to floating point. Implied bit is pow(2,-3)
</p>

<p>
pow(2,-3) + 0*pow(2,-4) + 1*pow(2,-5) (pow(2,5)==32, pow(2,-5) = 1/32.0)
</p>
</div>
</div>
