week12/presentation.org
*** Let's explore the bits of floats

#+BEGIN_SRC C :exports both
#include <math.h>
#include <stdio.h>
#include <inttypes.h>
// 0x1L MUST be used 0x1 causes bugs
#define BIT(x,y) (x & (0x1L << y))
#define MAXBITSTRBITS 129
static char _bitstr[MAXBITSTRBITS] = { '\0' };
static char * bitString(uint64_t value, const unsigned int bits) {
    // iterator must be uint64_t
    for (uint64_t i = 0 ; i < bits; i++) {
        char bit = (BIT(value,i))?'1':'0';
        _bitstr[bits-1-i] = bit;
    }
    _bitstr[bits] = '\0';
    return _bitstr;
}

// NOT PORTABLE
struct float_t {
    unsigned int mantissa:23; // LOWEST
    unsigned int exponent:8;
    unsigned int sign:1; // HIGHEST
};
// type pun for fun!
union floatint {
    float f;
    uint32_t i;
    struct float_t t;
};


int main() {
    float floats[] = {
        0.0,
       -0.0,
        INFINITY,
       -INFINITY,
        NAN,
        0.00001,
        0.0001,
        0.001,
        0.01,
        0.1,
        1.0,
        1/64.0,
        1/32.0,
        1/16.0,
        1/8.0,
        1/4.0,
        1/2.0,
        1.0,
        2.0,
        4.0,
        128.0,
        65536.0,
        0.15625,
        -0.15625,
        36893488147419103232.0, // 2**65
        -36893488147419103232.0 // 2**65
    };
    size_t nfloats = sizeof(floats)/sizeof(float);
    printf("We're printing floats!\n");
    printf("sizeof(floatint) == %lu\n", sizeof(union floatint));
    printf("sizeof(float_t) == %lu\n", sizeof(struct float_t));
    for (size_t i = 0; i < nfloats; i++) {
        float f = floats[i];
        union floatint fi = {.f=f};
        printf("%12g 0x%08x 0b%s\n", f, fi.i, bitString(fi.i, 32));
        /*
        printf("%12g 0x%08x sign: %hhu exponent: %3hhu exp-127: %4d mantissa: 0x%06x\n", 
               f,
               fi.i,
               fi.t.sign,
               fi.t.exponent,
               (int)fi.t.exponent - (int)127,
               fi.t.mantissa
        );*/
        // We don't need bitfields
        printf("%12g 0x%08x sign: %hhu exponent: %hhu exp-127: %4d mantissa: 0x%06x\n", 
               f,
               fi.i,
               (fi.i >> 31),
               ((fi.i << 1) >> 24),
               (int)((fi.i << 1) >> 24) - (int)127,
               (fi.i & 0x007FFFFF)
               //0000 0000 0111 1111 1111 1111 1111 1111
               //0      0   7    F    F   F    F    F
        );
         

    }
    puts("");
}
#+END_SRC

#+RESULTS:
#+begin_example
We're printing floats!
sizeof(floatint) == 4
sizeof(float_t) == 4
           0 0x00000000 0b00000000000000000000000000000000
           0 0x00000000 sign: 0 exponent: 0 exp-127: -127 mantissa: 0x000000
          -0 0x80000000 0b10000000000000000000000000000000
          -0 0x80000000 sign: 1 exponent: 0 exp-127: -127 mantissa: 0x000000
         inf 0x7f800000 0b01111111100000000000000000000000
         inf 0x7f800000 sign: 0 exponent: 255 exp-127:  128 mantissa: 0x000000
        -inf 0xff800000 0b11111111100000000000000000000000
        -inf 0xff800000 sign: 1 exponent: 255 exp-127:  128 mantissa: 0x000000
         nan 0x7fc00000 0b01111111110000000000000000000000
         nan 0x7fc00000 sign: 0 exponent: 255 exp-127:  128 mantissa: 0x400000
       1e-05 0x3727c5ac 0b00110111001001111100010110101100
       1e-05 0x3727c5ac sign: 0 exponent: 110 exp-127:  -17 mantissa: 0x27c5ac
      0.0001 0x38d1b717 0b00111000110100011011011100010111
      0.0001 0x38d1b717 sign: 0 exponent: 113 exp-127:  -14 mantissa: 0x51b717
       0.001 0x3a83126f 0b00111010100000110001001001101111
       0.001 0x3a83126f sign: 0 exponent: 117 exp-127:  -10 mantissa: 0x03126f
        0.01 0x3c23d70a 0b00111100001000111101011100001010
        0.01 0x3c23d70a sign: 0 exponent: 120 exp-127:   -7 mantissa: 0x23d70a
         0.1 0x3dcccccd 0b00111101110011001100110011001101
         0.1 0x3dcccccd sign: 0 exponent: 123 exp-127:   -4 mantissa: 0x4ccccd
           1 0x3f800000 0b00111111100000000000000000000000
           1 0x3f800000 sign: 0 exponent: 127 exp-127:    0 mantissa: 0x000000
    0.015625 0x3c800000 0b00111100100000000000000000000000
    0.015625 0x3c800000 sign: 0 exponent: 121 exp-127:   -6 mantissa: 0x000000
     0.03125 0x3d000000 0b00111101000000000000000000000000
     0.03125 0x3d000000 sign: 0 exponent: 122 exp-127:   -5 mantissa: 0x000000
      0.0625 0x3d800000 0b00111101100000000000000000000000
      0.0625 0x3d800000 sign: 0 exponent: 123 exp-127:   -4 mantissa: 0x000000
       0.125 0x3e000000 0b00111110000000000000000000000000
       0.125 0x3e000000 sign: 0 exponent: 124 exp-127:   -3 mantissa: 0x000000
        0.25 0x3e800000 0b00111110100000000000000000000000
        0.25 0x3e800000 sign: 0 exponent: 125 exp-127:   -2 mantissa: 0x000000
         0.5 0x3f000000 0b00111111000000000000000000000000
         0.5 0x3f000000 sign: 0 exponent: 126 exp-127:   -1 mantissa: 0x000000
           1 0x3f800000 0b00111111100000000000000000000000
           1 0x3f800000 sign: 0 exponent: 127 exp-127:    0 mantissa: 0x000000
           2 0x40000000 0b01000000000000000000000000000000
           2 0x40000000 sign: 0 exponent: 128 exp-127:    1 mantissa: 0x000000
           4 0x40800000 0b01000000100000000000000000000000
           4 0x40800000 sign: 0 exponent: 129 exp-127:    2 mantissa: 0x000000
         128 0x43000000 0b01000011000000000000000000000000
         128 0x43000000 sign: 0 exponent: 134 exp-127:    7 mantissa: 0x000000
       65536 0x47800000 0b01000111100000000000000000000000
       65536 0x47800000 sign: 0 exponent: 143 exp-127:   16 mantissa: 0x000000
     0.15625 0x3e200000 0b00111110001000000000000000000000
     0.15625 0x3e200000 sign: 0 exponent: 124 exp-127:   -3 mantissa: 0x200000
    -0.15625 0xbe200000 0b10111110001000000000000000000000
    -0.15625 0xbe200000 sign: 1 exponent: 124 exp-127:   -3 mantissa: 0x200000
 3.68935e+19 0x60000000 0b01100000000000000000000000000000
 3.68935e+19 0x60000000 sign: 0 exponent: 192 exp-127:   65 mantissa: 0x000000
-3.68935e+19 0xe0000000 0b11100000000000000000000000000000
-3.68935e+19 0xe0000000 sign: 1 exponent: 192 exp-127:   65 mantissa: 0x000000
#+end_example

