week12/presentation.html

<div id="outline-container-org5dd151a" class="outline-4">
<h4 id="org5dd151a"><span class="section-number-4">1.6.3</span> Let's explore the bits of floats</h4>
<div class="outline-text-4" id="text-1-6-3">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;math.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;inttypes.h&gt;</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">0x1L MUST be used 0x1 causes bugs</span>
<span style="color: #483d8b;">#define</span> <span style="color: #0000ff;">BIT</span>(<span style="color: #a0522d;">x</span>,<span style="color: #a0522d;">y</span>) (x &amp; (0x1L &lt;&lt; y))
<span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">MAXBITSTRBITS</span> 129
<span style="color: #a020f0;">static</span> <span style="color: #228b22;">char</span> <span style="color: #a0522d;">_bitstr</span>[MAXBITSTRBITS] = { <span style="color: #8b2252;">'\0'</span> };
<span style="color: #a020f0;">static</span> <span style="color: #228b22;">char</span> * <span style="color: #0000ff;">bitString</span>(<span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">value</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">unsigned</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">bits</span>) {
    <span style="color: #b22222;">// </span><span style="color: #b22222;">iterator must be uint64_t</span>
    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">i</span> = 0 ; i &lt; bits; i++) {
        <span style="color: #228b22;">char</span> <span style="color: #a0522d;">bit</span> = (BIT(value,i))?<span style="color: #8b2252;">'1'</span>:<span style="color: #8b2252;">'0'</span>;
        _bitstr[bits-1-i] = bit;
    }
    _bitstr[bits] = <span style="color: #8b2252;">'\0'</span>;
    <span style="color: #a020f0;">return</span> _bitstr;
}

<span style="color: #b22222;">// </span><span style="color: #b22222;">NOT PORTABLE</span>
<span style="color: #a020f0;">struct</span> <span style="color: #228b22;">float_t</span> {
    <span style="color: #228b22;">unsigned</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">mantissa</span>:23; <span style="color: #b22222;">// </span><span style="color: #b22222;">LOWEST</span>
    <span style="color: #228b22;">unsigned</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">exponent</span>:8;
    <span style="color: #228b22;">unsigned</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">sign</span>:1; <span style="color: #b22222;">// </span><span style="color: #b22222;">HIGHEST</span>
};
<span style="color: #b22222;">// </span><span style="color: #b22222;">type pun for fun!</span>
<span style="color: #a020f0;">union</span> <span style="color: #228b22;">floatint</span> {
    <span style="color: #228b22;">float</span> <span style="color: #a0522d;">f</span>;
    <span style="color: #228b22;">uint32_t</span> <span style="color: #a0522d;">i</span>;
    <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">float_t</span> <span style="color: #a0522d;">t</span>;
};


<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #228b22;">float</span> <span style="color: #a0522d;">floats</span>[] = {
        0.0,
       -0.0,
        INFINITY,
       -INFINITY,
        NAN,
        0.00001,
        0.0001,
        0.001,
        0.01,
        0.1,
        1.0,
        1/64.0,
        1/32.0,
        1/16.0,
        1/8.0,
        1/4.0,
        1/2.0,
        1.0,
        2.0,
        4.0,
        128.0,
        65536.0,
        0.15625,
        -0.15625,
        36893488147419103232.0, <span style="color: #b22222;">// </span><span style="color: #b22222;">2**65</span>
        -36893488147419103232.0 <span style="color: #b22222;">// </span><span style="color: #b22222;">2**65</span>
    };
    <span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">nfloats</span> = <span style="color: #a020f0;">sizeof</span>(floats)/<span style="color: #a020f0;">sizeof</span>(<span style="color: #228b22;">float</span>);
    printf(<span style="color: #8b2252;">"We're printing floats!\n"</span>);
    printf(<span style="color: #8b2252;">"sizeof(floatint) == %lu\n"</span>, <span style="color: #a020f0;">sizeof</span>(<span style="color: #a020f0;">union</span> <span style="color: #228b22;">floatint</span>));
    printf(<span style="color: #8b2252;">"sizeof(float_t) == %lu\n"</span>, <span style="color: #a020f0;">sizeof</span>(<span style="color: #a020f0;">struct</span> <span style="color: #228b22;">float_t</span>));
    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">i</span> = 0; i &lt; nfloats; i++) {
        <span style="color: #228b22;">float</span> <span style="color: #a0522d;">f</span> = floats[i];
        <span style="color: #a020f0;">union</span> <span style="color: #228b22;">floatint</span> <span style="color: #a0522d;">fi</span> = {.f=f};
        printf(<span style="color: #8b2252;">"%12g 0x%08x 0b%s\n"</span>, f, fi.i, bitString(fi.i, 32));
        <span style="color: #b22222;">/*</span>
<span style="color: #b22222;">        printf("%12g 0x%08x sign: %hhu exponent: %3hhu exp-127: %4d mantissa: 0x%06x\n", </span>
<span style="color: #b22222;">               f,</span>
<span style="color: #b22222;">               fi.i,</span>
<span style="color: #b22222;">               fi.t.sign,</span>
<span style="color: #b22222;">               fi.t.exponent,</span>
<span style="color: #b22222;">               (int)fi.t.exponent - (int)127,</span>
<span style="color: #b22222;">               fi.t.mantissa</span>
<span style="color: #b22222;">        );</span><span style="color: #b22222;">*/</span>
        <span style="color: #b22222;">// </span><span style="color: #b22222;">We don't need bitfields</span>
        printf(<span style="color: #8b2252;">"%12g 0x%08x sign: %hhu exponent: %hhu exp-127: %4d mantissa: 0x%06x\n"</span>, 
               f,
               fi.i,
               (fi.i &gt;&gt; 31),
               ((fi.i &lt;&lt; 1) &gt;&gt; 24),
               (<span style="color: #228b22;">int</span>)((fi.i &lt;&lt; 1) &gt;&gt; 24) - (<span style="color: #228b22;">int</span>)127,
               (fi.i &amp; 0x007FFFFF)
               <span style="color: #b22222;">//</span><span style="color: #b22222;">0000 0000 0111 1111 1111 1111 1111 1111</span>
               <span style="color: #b22222;">//</span><span style="color: #b22222;">0      0   7    F    F   F    F    F</span>
        );


    }
    puts(<span style="color: #8b2252;">""</span>);
}
</pre>
</div>

<pre class="example">
We're printing floats!
sizeof(floatint) == 4
sizeof(float_t) == 4
           0 0x00000000 0b00000000000000000000000000000000
           0 0x00000000 sign: 0 exponent: 0 exp-127: -127 mantissa: 0x000000
          -0 0x80000000 0b10000000000000000000000000000000
          -0 0x80000000 sign: 1 exponent: 0 exp-127: -127 mantissa: 0x000000
         inf 0x7f800000 0b01111111100000000000000000000000
         inf 0x7f800000 sign: 0 exponent: 255 exp-127:  128 mantissa: 0x000000
        -inf 0xff800000 0b11111111100000000000000000000000
        -inf 0xff800000 sign: 1 exponent: 255 exp-127:  128 mantissa: 0x000000
         nan 0x7fc00000 0b01111111110000000000000000000000
         nan 0x7fc00000 sign: 0 exponent: 255 exp-127:  128 mantissa: 0x400000
       1e-05 0x3727c5ac 0b00110111001001111100010110101100
       1e-05 0x3727c5ac sign: 0 exponent: 110 exp-127:  -17 mantissa: 0x27c5ac
      0.0001 0x38d1b717 0b00111000110100011011011100010111
      0.0001 0x38d1b717 sign: 0 exponent: 113 exp-127:  -14 mantissa: 0x51b717
       0.001 0x3a83126f 0b00111010100000110001001001101111
       0.001 0x3a83126f sign: 0 exponent: 117 exp-127:  -10 mantissa: 0x03126f
        0.01 0x3c23d70a 0b00111100001000111101011100001010
        0.01 0x3c23d70a sign: 0 exponent: 120 exp-127:   -7 mantissa: 0x23d70a
         0.1 0x3dcccccd 0b00111101110011001100110011001101
         0.1 0x3dcccccd sign: 0 exponent: 123 exp-127:   -4 mantissa: 0x4ccccd
           1 0x3f800000 0b00111111100000000000000000000000
           1 0x3f800000 sign: 0 exponent: 127 exp-127:    0 mantissa: 0x000000
    0.015625 0x3c800000 0b00111100100000000000000000000000
    0.015625 0x3c800000 sign: 0 exponent: 121 exp-127:   -6 mantissa: 0x000000
     0.03125 0x3d000000 0b00111101000000000000000000000000
     0.03125 0x3d000000 sign: 0 exponent: 122 exp-127:   -5 mantissa: 0x000000
      0.0625 0x3d800000 0b00111101100000000000000000000000
      0.0625 0x3d800000 sign: 0 exponent: 123 exp-127:   -4 mantissa: 0x000000
       0.125 0x3e000000 0b00111110000000000000000000000000
       0.125 0x3e000000 sign: 0 exponent: 124 exp-127:   -3 mantissa: 0x000000
        0.25 0x3e800000 0b00111110100000000000000000000000
        0.25 0x3e800000 sign: 0 exponent: 125 exp-127:   -2 mantissa: 0x000000
         0.5 0x3f000000 0b00111111000000000000000000000000
         0.5 0x3f000000 sign: 0 exponent: 126 exp-127:   -1 mantissa: 0x000000
           1 0x3f800000 0b00111111100000000000000000000000
           1 0x3f800000 sign: 0 exponent: 127 exp-127:    0 mantissa: 0x000000
           2 0x40000000 0b01000000000000000000000000000000
           2 0x40000000 sign: 0 exponent: 128 exp-127:    1 mantissa: 0x000000
           4 0x40800000 0b01000000100000000000000000000000
           4 0x40800000 sign: 0 exponent: 129 exp-127:    2 mantissa: 0x000000
         128 0x43000000 0b01000011000000000000000000000000
         128 0x43000000 sign: 0 exponent: 134 exp-127:    7 mantissa: 0x000000
       65536 0x47800000 0b01000111100000000000000000000000
       65536 0x47800000 sign: 0 exponent: 143 exp-127:   16 mantissa: 0x000000
     0.15625 0x3e200000 0b00111110001000000000000000000000
     0.15625 0x3e200000 sign: 0 exponent: 124 exp-127:   -3 mantissa: 0x200000
    -0.15625 0xbe200000 0b10111110001000000000000000000000
    -0.15625 0xbe200000 sign: 1 exponent: 124 exp-127:   -3 mantissa: 0x200000
 3.68935e+19 0x60000000 0b01100000000000000000000000000000
 3.68935e+19 0x60000000 sign: 0 exponent: 192 exp-127:   65 mantissa: 0x000000
-3.68935e+19 0xe0000000 0b11100000000000000000000000000000
-3.68935e+19 0xe0000000 sign: 1 exponent: 192 exp-127:   65 mantissa: 0x000000
</pre>
</div>
</div>
