week12/presentation.org
*** How do I avoid typepunning?

The C99 is OK with union type punning :-/

The "blessed" way that is C11 compatible is memcpy.

Bitfields are generally considered "CURSED" due to platform specific
behaviour.

You should only memcpy direct types like uint64_t and double IFF they
have the same size.

#+begin_src c :eval no :main no :exports code
  // PUN64 copies the bits of double value into a 64bit unsigned int and
  // returns it.
  uint64_t PUN64(double value) {
    uint64_t output = 0;
    memcpy(&output, &value, sizeof(uint64_t));
    return output;
  }
#+end_src

** Modules

A module can have different levels of granularity:

- function level 
- file level (.c or .h)
- library level (shared code .so)
- process level (an executable)
- platform level (GNU/Linux)
- service level (distributed systems, webservices)
- ecosystem level (Ubuntu or pip or web)

In C typically a module refers to a pair of .c file or a pair of .h
and .c files.

** Coupling

Coupling often refers to how much 1 module (like a .c file or a .h
file) relies on other modules.

*** Coupling

1 fast way in C of calculating coupling is to count the number of
include directives.

The number of includes gives one an idea of how many modules that your
module relies upon.

In object oriented languages like Java or C++ coupling often refers to
the number of modules (Classes) that a single class refers to.

Coupling is related to dependencies. Too many dependencies makes a
system complicated--often erroneously called complex. If one of these
dependencies changes, breaks, is deprecated it can harm anything that
relies upon it. Knowing that a module is heavily relied upon is
important as well because it implies the risk involved with changing
that module.

High coupling is bad because it makes code weak to change:
- too many dependencies increase risk of change
- too many dependencies increase bug risk
- too many dependencies means dependencies will probably change

In "structured design" as suggested by Constantine there are multiple
kinds of coupling.

- Data coupling: you pass parameters to another module
  - connected by name
- Control coupling: you use another module for control flow
- Content/Common coupling: when you use code directly from another module
  - macros can cause this problem
  - includes could do this if it includes code.

Fundamentally in C at the file level we're really just going to be
using data coupling. If you say coupling most people will assume this
is what you are talking about. Essentially your .h or .c file refers
to other modules and their parts by name.

*** Graph Coupling

From Pressman and Dhama [DHA95].

Model your modules as a directed graph.
- Modules are vertices.
- References are edges.

Fan-out is the number of modules a module calls.

Fan-in is the number of modules that call that module. Fan-in does not
imply the module is truly coupled to other modules, just that it is
popular and relied upon. Meaning it shouldn't change much!

From Pressman and Dhama [DHA95]:

For data and control flow coupling,

- d_i = number of input data parameters
- c_i = number of input control parameters
- d_o = number of output data parameters
- c_o = number of output control parameters

For global coupling,

- g_d = number of global variables used as data
- g_c = number of global variables used as control

For environmental coupling,

- w = number of modules called (fan-out)
- r = number of modules calling the module under consideration (fan-in)

Using these measures, a module coupling indicator, m c , is defined in the following way:

 - m_c = k/M = 1/(d_i + (a * c_i ) + d_o + (b * c_o ) + g_d + (c* g_c ) + w + r)
   - alternative m_c = k/M = 1/(1 + w + r)
 - where k = 1, a proportionality constant 8 and

 - M = d_i + (a * c_i ) + d_o + (b * c_o ) + g_d + (c* g_c ) + w + r
 - where a = b = c = 2.

High m_c: low coupling
Low  m_c: high coupling

**** Coupling_h -- my take

My take?

Forget about the nitty gritty coupling and focus on
fan-out and dependencies.

I would calculate coupling as unidirectional:

- where x = number of unique external function calls
- where y = number of unique external variable access
- where z = number of unique externally defined types
- where w = number of modules called (fan-out)
- where lambda ~ 4 or however more important you feel that fan-out is
- w = number of modules called (fan-out)
- coupling_h = 1 / (1 + lambda*w + x + y + z)

If coupling_h is 1 you are decoupled.

If coupling_h in near 0.0 you are pretty heavily coupled.

For a C module I recommend counting both .h and .c together

You can invent your own coupling measures for your own purposes.

**** Coupling Examples
***** No Coupling
#+begin_src C :eval no :exports code
// 0 coupling, no modules
#define RET 404
int main() {
    return RET;
}
#+end_src

- w = x = y = z = 0
- lamba = 4
- coupling_h = 1/(1+0) = 1

***** A little coupling

We're now related to the stdlib IO routines

#+begin_src C :eval no :exports code
#include <stdio.h>
#define RET
int main() {
    printf("%d\n", RET);
    return RET;
}
#+end_src

- w = 1
- x = 1
- y = z = 0
- lamba = 4
- coupling_h = 1/(4*1+1+0+0) = 1/5


***** A little more coupling

Now we're bound to stdlib.h and randr

#+begin_src C :eval no :exports code
#include <stdio.h>
#include <stdlib.h>
#define RET
int main() {
    printf("%d\n", rand());
    return RET;
}
#+end_src

- w = 2
- x = 2
- y = z = 0
- lamba = 4
- coupling_h = 1/(4*2+2+0+0) = 1/10

