week12/presentation.html

<div id="outline-container-org6d3557f" class="outline-4">
<h4 id="org6d3557f"><span class="section-number-4">1.6.4</span> How do I avoid typepunning?</h4>
<div class="outline-text-4" id="text-1-6-4">
<p>
The C99 is OK with union type punning :-/
</p>

<p>
The "blessed" way that is C11 compatible is memcpy.
</p>

<p>
Bitfields are generally considered "CURSED" due to platform specific
behaviour.
</p>

<p>
You should only memcpy direct types like uint64<sub>t</sub> and double IFF they
have the same size.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #b22222;">// </span><span style="color: #b22222;">PUN64 copies the bits of double value into a 64bit unsigned int and</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">returns it.</span>
<span style="color: #228b22;">uint64_t</span> <span style="color: #0000ff;">PUN64</span>(<span style="color: #228b22;">double</span> <span style="color: #a0522d;">value</span>) {
  <span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">output</span> = 0;
  memcpy(&amp;output, &amp;value, <span style="color: #a020f0;">sizeof</span>(uint64_t));
  <span style="color: #a020f0;">return</span> output;
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org00fb701" class="outline-3">
<h3 id="org00fb701"><span class="section-number-3">1.7</span> Modules</h3>
<div class="outline-text-3" id="text-1-7">
<p>
A module can have different levels of granularity:
</p>

<ul class="org-ul">
<li>function level</li>
<li>file level (.c or .h)</li>
<li>library level (shared code .so)</li>
<li>process level (an executable)</li>
<li>platform level (GNU/Linux)</li>
<li>service level (distributed systems, webservices)</li>
<li>ecosystem level (Ubuntu or pip or web)</li>
</ul>

<p>
In C typically a module refers to a pair of .c file or a pair of .h
and .c files.
</p>
</div>
</div>

<div id="outline-container-org3573c9a" class="outline-3">
<h3 id="org3573c9a"><span class="section-number-3">1.8</span> Coupling</h3>
<div class="outline-text-3" id="text-1-8">
<p>
Coupling often refers to how much 1 module (like a .c file or a .h
file) relies on other modules.
</p>
</div>

<div id="outline-container-orge147e27" class="outline-4">
<h4 id="orge147e27"><span class="section-number-4">1.8.1</span> Coupling</h4>
<div class="outline-text-4" id="text-1-8-1">
<p>
1 fast way in C of calculating coupling is to count the number of
include directives.
</p>

<p>
The number of includes gives one an idea of how many modules that your
module relies upon.
</p>

<p>
In object oriented languages like Java or C++ coupling often refers to
the number of modules (Classes) that a single class refers to.
</p>

<p>
Coupling is related to dependencies. Too many dependencies makes a
system complicated&#x2013;often erroneously called complex. If one of these
dependencies changes, breaks, is deprecated it can harm anything that
relies upon it. Knowing that a module is heavily relied upon is
important as well because it implies the risk involved with changing
that module.
</p>

<p>
High coupling is bad because it makes code weak to change:
</p>
<ul class="org-ul">
<li>too many dependencies increase risk of change</li>
<li>too many dependencies increase bug risk</li>
<li>too many dependencies means dependencies will probably change</li>
</ul>

<p>
In "structured design" as suggested by Constantine there are multiple
kinds of coupling.
</p>

<ul class="org-ul">
<li>Data coupling: you pass parameters to another module
<ul class="org-ul">
<li>connected by name</li>
</ul></li>
<li>Control coupling: you use another module for control flow</li>
<li>Content/Common coupling: when you use code directly from another module
<ul class="org-ul">
<li>macros can cause this problem</li>
<li>includes could do this if it includes code.</li>
</ul></li>
</ul>

<p>
Fundamentally in C at the file level we're really just going to be
using data coupling. If you say coupling most people will assume this
is what you are talking about. Essentially your .h or .c file refers
to other modules and their parts by name.
</p>
</div>
</div>

<div id="outline-container-org4273518" class="outline-4">
<h4 id="org4273518"><span class="section-number-4">1.8.2</span> Graph Coupling</h4>
<div class="outline-text-4" id="text-1-8-2">
<p>
From Pressman and Dhama [DHA95].
</p>

<p>
Model your modules as a directed graph.
</p>
<ul class="org-ul">
<li>Modules are vertices.</li>
<li>References are edges.</li>
</ul>

<p>
Fan-out is the number of modules a module calls.
</p>

<p>
Fan-in is the number of modules that call that module. Fan-in does not
imply the module is truly coupled to other modules, just that it is
popular and relied upon. Meaning it shouldn't change much!
</p>

<p>
From Pressman and Dhama [DHA95]:
</p>

<p>
For data and control flow coupling,
</p>

<ul class="org-ul">
<li>d<sub>i</sub> = number of input data parameters</li>
<li>c<sub>i</sub> = number of input control parameters</li>
<li>d<sub>o</sub> = number of output data parameters</li>
<li>c<sub>o</sub> = number of output control parameters</li>
</ul>

<p>
For global coupling,
</p>

<ul class="org-ul">
<li>g<sub>d</sub> = number of global variables used as data</li>
<li>g<sub>c</sub> = number of global variables used as control</li>
</ul>

<p>
For environmental coupling,
</p>

<ul class="org-ul">
<li>w = number of modules called (fan-out)</li>
<li>r = number of modules calling the module under consideration (fan-in)</li>
</ul>

<p>
Using these measures, a module coupling indicator, m c , is defined in the following way:
</p>

<ul class="org-ul">
<li>m<sub>c</sub> = k/M = 1/(d<sub>i</sub> + (a * c<sub>i</sub> ) + d<sub>o</sub> + (b * c<sub>o</sub> ) + g<sub>d</sub> + (c* g<sub>c</sub> ) + w + r)
<ul class="org-ul">
<li>alternative m<sub>c</sub> = k/M = 1/(1 + w + r)</li>
</ul></li>
<li>where k = 1, a proportionality constant 8 and</li>

<li>M = d<sub>i</sub> + (a * c<sub>i</sub> ) + d<sub>o</sub> + (b * c<sub>o</sub> ) + g<sub>d</sub> + (c* g<sub>c</sub> ) + w + r</li>
<li>where a = b = c = 2.</li>
</ul>

<p>
High m<sub>c</sub>: low coupling
Low  m<sub>c</sub>: high coupling
</p>
</div>

<ol class="org-ol">
<li><a id="orgd19664d"></a>Coupling<sub>h</sub> &#x2013; my take<br />
<div class="outline-text-5" id="text-1-8-2-1">
<p>
My take?
</p>

<p>
Forget about the nitty gritty coupling and focus on
fan-out and dependencies.
</p>

<p>
I would calculate coupling as unidirectional:
</p>

<ul class="org-ul">
<li>where x = number of unique external function calls</li>
<li>where y = number of unique external variable access</li>
<li>where z = number of unique externally defined types</li>
<li>where w = number of modules called (fan-out)</li>
<li>where lambda ~ 4 or however more important you feel that fan-out is</li>
<li>w = number of modules called (fan-out)</li>
<li>coupling<sub>h</sub> = 1 / (1 + lambda*w + x + y + z)</li>
</ul>

<p>
If coupling<sub>h</sub> is 1 you are decoupled.
</p>

<p>
If coupling<sub>h</sub> in near 0.0 you are pretty heavily coupled.
</p>

<p>
For a C module I recommend counting both .h and .c together
</p>

<p>
You can invent your own coupling measures for your own purposes.
</p>
</div>
</li>

<li><a id="orgb496a00"></a>Coupling Examples<br />
<ol class="org-ol">
<li><a id="org0ceee86"></a>No Coupling<br />
<div class="outline-text-6" id="text-1-8-2-2-1">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #b22222;">// </span><span style="color: #b22222;">0 coupling, no modules</span>
<span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">RET</span> 404
<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #a020f0;">return</span> RET;
}
</pre>
</div>

<ul class="org-ul">
<li>w = x = y = z = 0</li>
<li>lamba = 4</li>
<li>coupling<sub>h</sub> = 1/(1+0) = 1</li>
</ul>
</div>
</li>

<li><a id="org2651dd4"></a>A little coupling<br />
<div class="outline-text-6" id="text-1-8-2-2-2">
<p>
We're now related to the stdlib IO routines
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">RET</span>
<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    printf(<span style="color: #8b2252;">"%d\n"</span>, RET);
    <span style="color: #a020f0;">return</span> RET;
}
</pre>
</div>

<ul class="org-ul">
<li>w = 1</li>
<li>x = 1</li>
<li>y = z = 0</li>
<li>lamba = 4</li>
<li>coupling<sub>h</sub> = 1/(4*1+1+0+0) = 1/5</li>
</ul>
</div>
</li>


<li><a id="orgffd2023"></a>A little more coupling<br />
<div class="outline-text-6" id="text-1-8-2-2-3">
<p>
Now we're bound to stdlib.h and randr
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>
<span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">RET</span>
<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    printf(<span style="color: #8b2252;">"%d\n"</span>, rand());
    <span style="color: #a020f0;">return</span> RET;
}
</pre>
</div>

<ul class="org-ul">
<li>w = 2</li>
<li>x = 2</li>
<li>y = z = 0</li>
<li>lamba = 4</li>
<li>coupling<sub>h</sub> = 1/(4*2+2+0+0) = 1/10</li>
</ul>
</div>
</li>
