week12/presentation.org
***** More coupling

Now we're bound to string.h as well

#+begin_src C :eval no :exports code
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#define RET
int main() {
    char * str1 = "aaaaaa";
    char * str2 = "aaaaab";
    printf("%d\n", rand());
    printf("%d\n", strcmp(str1,str2));
    return RET;
}
#+end_src

- w = 3
- x = 3
- y = z = 0
- lamba = 4
- coupling_h = 1/(4*3+3+0+0) = 1/15

***** Even More Coupling:

#+begin_src C :eval no :exports code
/*

                            Encode CSV file into MIDI

        The CSV file must be in the format generated by midicsv--while
        you can add and delete events and change their contents, the
        overall organisation of the file must be the same.

        Designed and implemented in October of 1998 by John Walker.
        Revised and updated in February of 2004 by the same perp.

                       http://www.fourmilab.ch/
                       
                This program is in the public domain.

*/

#define PROG    "csvmidi"

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <ctype.h>
#ifdef _WIN32
#include <fcntl.h>
#include <io.h>
#define strcasecmp _stricmp
#endif

#include "version.h"
#include "types.h"
#include "midifile.h"
#include "midio.h"
#include "csv.h"
#include "getopt.h"
#+end_src

- w = 10 or 12
- x = ??
- y = z = ??
- lamba = 4
- coupling_h = 1/(4*10+0+0) = 1/40


