week12/presentation.html

<li><a id="orgb310d62"></a>More coupling<br />
<div class="outline-text-6" id="text-1-8-2-2-4">
<p>
Now we're bound to string.h as well
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;string.h&gt;</span>
<span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">RET</span>
<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #228b22;">char</span> * <span style="color: #a0522d;">str1</span> = <span style="color: #8b2252;">"aaaaaa"</span>;
    <span style="color: #228b22;">char</span> * <span style="color: #a0522d;">str2</span> = <span style="color: #8b2252;">"aaaaab"</span>;
    printf(<span style="color: #8b2252;">"%d\n"</span>, rand());
    printf(<span style="color: #8b2252;">"%d\n"</span>, strcmp(str1,str2));
    <span style="color: #a020f0;">return</span> RET;
}
</pre>
</div>

<ul class="org-ul">
<li>w = 3</li>
<li>x = 3</li>
<li>y = z = 0</li>
<li>lamba = 4</li>
<li>coupling<sub>h</sub> = 1/(4*3+3+0+0) = 1/15</li>
</ul>
</div>
</li>

<li><a id="orgbea7206"></a>Even More Coupling:<br />
<div class="outline-text-6" id="text-1-8-2-2-5">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #b22222;">/*</span>

<span style="color: #b22222;">                            Encode CSV file into MIDI</span>

<span style="color: #b22222;">        The CSV file must be in the format generated by midicsv--while</span>
<span style="color: #b22222;">        you can add and delete events and change their contents, the</span>
<span style="color: #b22222;">        overall organisation of the file must be the same.</span>

<span style="color: #b22222;">        Designed and implemented in October of 1998 by John Walker.</span>
<span style="color: #b22222;">        Revised and updated in February of 2004 by the same perp.</span>

<span style="color: #b22222;">                       http://www.fourmilab.ch/</span>

<span style="color: #b22222;">                This program is in the public domain.</span>

<span style="color: #b22222;">*/</span>

<span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">PROG</span>    <span style="color: #8b2252;">"csvmidi"</span>

<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;string.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;ctype.h&gt;</span>
<span style="color: #483d8b;">#ifdef</span> _WIN32
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;fcntl.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;io.h&gt;</span>
<span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">strcasecmp</span> _stricmp
<span style="color: #483d8b;">#endif</span>

<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">"version.h"</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">"types.h"</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">"midifile.h"</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">"midio.h"</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">"csv.h"</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">"getopt.h"</span>
</pre>
</div>

<ul class="org-ul">
<li>w = 10 or 12</li>
<li>x = ??</li>
<li>y = z = ??</li>
<li>lamba = 4</li>
<li>coupling<sub>h</sub> = 1/(4*10+0+0) = 1/40</li>
</ul>
</div>
</li>
