week12/presentation.org
***** More examples from Assignment 8

checkinput.h 
#+begin_src c :eval no :exports code
// Have a guard to ensure that we don't include it multiple times.
#ifndef _CHECKINPUT_H_
/* checkInput: given the result of scanf check if it 
 * 0 elements read or EOF. If so exit(1) with a warning.
 *
 */
#define _CHECKINPUT_H_
void checkInput(int err); // a prototype!
#endif
#+end_src

- coupling_h = 1 = 1/1

#+begin_src C :eval no :exports code
#include "parameters.h"
#include <stdio.h>
#include <stdlib.h>

// You must implement a guard

struct combo_t;

typedef struct combo_t * Combo;

// Create a Cartesian Product Combo generator
Combo createParameterCombo();
// Add parameter definition to the Combo
void addParameterDefCombo(Combo combo, ParameterDef def);
// Add a parameter of a previous parameter definition to the Combo
size_t addParameterCombo(Combo combo, Parameter param);
// How man parameter definitions are defined in this combo
size_t nParamsCombo(Combo combo);
// a boolean of whether or not there are more product combos to come
// used for terminating while loops
bool hasNextCombo(Combo combo);
// The next product combo as a malloc'd array of parameters of
// nParamsCombo(combo) length
Parameter * nextCombo(Combo combo);
// Free a parameter list created by nextCombo
void freeParamsCombo(Combo combo, Parameter * params);
// Free a cartesian product combo generator
void freeCombo(Combo combo);
#+end_src

- w=3
- z=2
- coupling_h = 1/(4*w + z)

parameter.h
#+begin_src C :eval no :exports code
// Implement a guard

#include <inttypes.h>
#include <stdbool.h>
#include <stdlib.h>

enum type_flag {
  LONG,
  DOUBLE,
  STRING,
  CHAR,
};

typedef enum type_flag TypeFlag;

union any_t {
  int64_t aLong;
  double aDouble;
  char * aString;
  char aChar;
};

typedef union any_t Any;

struct parameter_def {
  char * name;
  TypeFlag type;
};

typedef struct parameter_def ParameterDef;

struct parameter_t {
  ParameterDef def;
  Any any;
};

typedef struct parameter_t Parameter;

// create a parameter def for aDouble
ParameterDef doubleParameterDef( char * name );
// create a parameter def for aLong
ParameterDef longParameterDef(   char * name );
// create a parameter def for aString
ParameterDef stringParameterDef( char * name );
// create a parameter def for aChar
ParameterDef charParameterDef(   char * name );
// create a parameter def for aChar
ParameterDef mkParameterDef(   char * name, TypeFlag flag );

// Are param1 and param2 equal?
bool         equalParameterDef(  ParameterDef param1, ParameterDef param2);

// create a double parameter 
Parameter    mkDoubleParameter(  ParameterDef def, double value);
// create a long parameter 
Parameter    mkLongParameter(    ParameterDef def, long   value);
// create a string parameter 
Parameter    mkStringParameter(  ParameterDef def, char * value);
// create a char parameter 
Parameter    mkCharParameter(    ParameterDef def, char   value);
// return the name of a parameter's def
char *       nameParameter(      Parameter param );
// return the type of a parameter from its def
TypeFlag     typeParameter(      Parameter param );
// return the double value of a parameter
double       doubleParameter(    Parameter param );
// return the long value of a parameter
long         longParameter(      Parameter param );
// return the string value of a parameter
char *       stringParameter(    Parameter param );
// return the char value of a parameter
char         charParameter(      Parameter param );
// Are param1 and param2 equal?
bool         equalParameter(     Parameter param1, Parameter param2);
// Print parameters!
void printParams(Parameter * params, size_t size);
#+end_src

3 includes 

- w=3
- z=0
- coupling_h = 1/(4*w + z)

ppdarray.h
#+begin_src C :eval no :exports code
#include "parameters.h"
#include <inttypes.h>
#include <stdlib.h>
#include <stdio.h>

// You need a guard here!

// forward declaration
union ppd_t;
// This is an array of defs, params, or arrays
// Assume you keep the same sort of values within this array
struct ppd_array {
  union ppd_t * params; // A pointer to an array of ppd_t unions (PPD)
  size_t size;
};
typedef struct ppd_array * PPDArray;

union ppd_t {
  ParameterDef       def;
  Parameter          param;
  struct ppd_array * array;
  int64_t            int64;
  char             * str;
};

typedef union ppd_t PPD;

// create PPDArray
PPDArray createPPDArray();
// get the number of elements in a PPDArray
size_t sizePPDArray(PPDArray array);
// Free a PPD Array
void freePPDArray(PPDArray array);
// Free a PPD Array and all of its PPD Arrays (not recursive)
// Frees an array of arrays, by freeing each contained array
void freeArrayPPDArray(PPDArray array);
// return a parameter def at index of PPDArray array
ParameterDef parameterDefPPDArray(PPDArray array, size_t index);
// return a pointer to parameter def at index of PPDArray array
// pretty unsafe
ParameterDef * parameterDefRefPPDArray(PPDArray array, size_t index);
// return a parameter at index of PPDArray array
Parameter parameterPPDArray(PPDArray array, size_t index);
// return a array at index of PPDArray array
PPDArray arrayPPDArray(PPDArray array, size_t index);
// return an int64 at index of PPDArray array
int64_t int64PPDArray(PPDArray array, size_t index);
// return a string at index of PPDArray array
char * stringPPDArray(PPDArray array, size_t index);
// at index of array set the int64 value to 
void setInt64PPDArray(PPDArray array, size_t index, int64_t value);
// extend PPDArray 1 slot and put this PPD into that slot
// may use realloc!
void addPPDPPDArray(PPDArray array, PPD defOrParam);
// extend PPDArray 1 slot and put this ParameterDef into that slot
// may use realloc!
void addDefPPDArray(PPDArray array, ParameterDef def);
// extend PPDArray 1 slot and put this Parameter into that slot
// may use realloc!
void addParamPPDArray(PPDArray array, Parameter param);
// extend PPDArray 1 slot and put this Array newArray into that slot
// may use realloc!
void addPPDArrayPPDArray(PPDArray array, PPDArray newArray  );
// extend PPDArray 1 slot and put this int64 into that slot
// may use realloc!
void addInt64PPDArray(PPDArray array, int64_t int64  );
// extend PPDArray 1 slot and put this string into that slot
// may use realloc!
void addStringPPDArray(PPDArray array, char * str );
#+end_src

3 includes & 3 reference to int64_t, Parameter and ParameterDef

- w=3
- z=3
- coupling_h = 1/(4*w + z)

