week12/presentation.html

<li><a id="org2ad9858"></a>More examples from Assignment 8<br />
<div class="outline-text-6" id="text-1-8-2-2-7">
<p>
checkinput.h 
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #b22222;">// </span><span style="color: #b22222;">Have a guard to ensure that we don't include it multiple times.</span>
<span style="color: #483d8b;">#if</span><span style="color: #483d8b;">n</span><span style="color: #483d8b;">def</span> _CHECKINPUT_H_
<span style="color: #b22222;">/* </span><span style="color: #b22222;">checkInput: given the result of scanf check if it </span>
<span style="color: #b22222;"> * 0 elements read or EOF. If so exit(1) with a warning.</span>
<span style="color: #b22222;"> *</span>
<span style="color: #b22222;"> </span><span style="color: #b22222;">*/</span>
<span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">_CHECKINPUT_H_</span>
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">checkInput</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">err</span>); <span style="color: #b22222;">// </span><span style="color: #b22222;">a prototype!</span>
<span style="color: #483d8b;">#endif</span>
</pre>
</div>

<ul class="org-ul">
<li>coupling<sub>h</sub> = 1 = 1/1</li>
</ul>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">"parameters.h"</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>

<span style="color: #b22222;">// </span><span style="color: #b22222;">You must implement a guard</span>

<span style="color: #a020f0;">struct</span> <span style="color: #228b22;">combo_t</span>;

<span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">combo_t</span> * <span style="color: #228b22;">Combo</span>;

<span style="color: #b22222;">// </span><span style="color: #b22222;">Create a Cartesian Product Combo generator</span>
<span style="color: #228b22;">Combo</span> <span style="color: #0000ff;">createParameterCombo</span>();
<span style="color: #b22222;">// </span><span style="color: #b22222;">Add parameter definition to the Combo</span>
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">addParameterDefCombo</span>(<span style="color: #228b22;">Combo</span> <span style="color: #a0522d;">combo</span>, <span style="color: #228b22;">ParameterDef</span> <span style="color: #a0522d;">def</span>);
<span style="color: #b22222;">// </span><span style="color: #b22222;">Add a parameter of a previous parameter definition to the Combo</span>
<span style="color: #228b22;">size_t</span> <span style="color: #0000ff;">addParameterCombo</span>(<span style="color: #228b22;">Combo</span> <span style="color: #a0522d;">combo</span>, <span style="color: #228b22;">Parameter</span> <span style="color: #a0522d;">param</span>);
<span style="color: #b22222;">// </span><span style="color: #b22222;">How man parameter definitions are defined in this combo</span>
<span style="color: #228b22;">size_t</span> <span style="color: #0000ff;">nParamsCombo</span>(<span style="color: #228b22;">Combo</span> <span style="color: #a0522d;">combo</span>);
<span style="color: #b22222;">// </span><span style="color: #b22222;">a boolean of whether or not there are more product combos to come</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">used for terminating while loops</span>
<span style="color: #228b22;">bool</span> <span style="color: #0000ff;">hasNextCombo</span>(<span style="color: #228b22;">Combo</span> <span style="color: #a0522d;">combo</span>);
<span style="color: #b22222;">// </span><span style="color: #b22222;">The next product combo as a malloc'd array of parameters of</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">nParamsCombo(combo) length</span>
<span style="color: #228b22;">Parameter</span> * <span style="color: #0000ff;">nextCombo</span>(<span style="color: #228b22;">Combo</span> <span style="color: #a0522d;">combo</span>);
<span style="color: #b22222;">// </span><span style="color: #b22222;">Free a parameter list created by nextCombo</span>
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">freeParamsCombo</span>(<span style="color: #228b22;">Combo</span> <span style="color: #a0522d;">combo</span>, <span style="color: #228b22;">Parameter</span> * <span style="color: #a0522d;">params</span>);
<span style="color: #b22222;">// </span><span style="color: #b22222;">Free a cartesian product combo generator</span>
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">freeCombo</span>(<span style="color: #228b22;">Combo</span> <span style="color: #a0522d;">combo</span>);
</pre>
</div>

<ul class="org-ul">
<li>w=3</li>
<li>z=2</li>
<li>coupling<sub>h</sub> = 1/(4*w + z)</li>
</ul>

<p>
parameter.h
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #b22222;">// </span><span style="color: #b22222;">Implement a guard</span>

<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;inttypes.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdbool.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>

<span style="color: #a020f0;">enum</span> <span style="color: #228b22;">type_flag</span> {
  <span style="color: #a0522d;">LONG</span>,
  <span style="color: #a0522d;">DOUBLE</span>,
  <span style="color: #a0522d;">STRING</span>,
  <span style="color: #a0522d;">CHAR</span>,
};

<span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">enum</span> <span style="color: #228b22;">type_flag</span> <span style="color: #228b22;">TypeFlag</span>;

<span style="color: #a020f0;">union</span> <span style="color: #228b22;">any_t</span> {
  <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">aLong</span>;
  <span style="color: #228b22;">double</span> <span style="color: #a0522d;">aDouble</span>;
  <span style="color: #228b22;">char</span> * <span style="color: #a0522d;">aString</span>;
  <span style="color: #228b22;">char</span> <span style="color: #a0522d;">aChar</span>;
};

<span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">union</span> <span style="color: #228b22;">any_t</span> <span style="color: #228b22;">Any</span>;

<span style="color: #a020f0;">struct</span> <span style="color: #228b22;">parameter_def</span> {
  <span style="color: #228b22;">char</span> * <span style="color: #a0522d;">name</span>;
  <span style="color: #228b22;">TypeFlag</span> <span style="color: #a0522d;">type</span>;
};

<span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">parameter_def</span> <span style="color: #228b22;">ParameterDef</span>;

<span style="color: #a020f0;">struct</span> <span style="color: #228b22;">parameter_t</span> {
  <span style="color: #228b22;">ParameterDef</span> <span style="color: #a0522d;">def</span>;
  <span style="color: #228b22;">Any</span> <span style="color: #a0522d;">any</span>;
};

<span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">parameter_t</span> <span style="color: #228b22;">Parameter</span>;

<span style="color: #b22222;">// </span><span style="color: #b22222;">create a parameter def for aDouble</span>
<span style="color: #228b22;">ParameterDef</span> <span style="color: #0000ff;">doubleParameterDef</span>( <span style="color: #228b22;">char</span> * <span style="color: #a0522d;">name</span> );
<span style="color: #b22222;">// </span><span style="color: #b22222;">create a parameter def for aLong</span>
<span style="color: #228b22;">ParameterDef</span> <span style="color: #0000ff;">longParameterDef</span>(   <span style="color: #228b22;">char</span> * <span style="color: #a0522d;">name</span> );
<span style="color: #b22222;">// </span><span style="color: #b22222;">create a parameter def for aString</span>
<span style="color: #228b22;">ParameterDef</span> <span style="color: #0000ff;">stringParameterDef</span>( <span style="color: #228b22;">char</span> * <span style="color: #a0522d;">name</span> );
<span style="color: #b22222;">// </span><span style="color: #b22222;">create a parameter def for aChar</span>
<span style="color: #228b22;">ParameterDef</span> <span style="color: #0000ff;">charParameterDef</span>(   <span style="color: #228b22;">char</span> * <span style="color: #a0522d;">name</span> );
<span style="color: #b22222;">// </span><span style="color: #b22222;">create a parameter def for aChar</span>
<span style="color: #228b22;">ParameterDef</span> <span style="color: #0000ff;">mkParameterDef</span>(   <span style="color: #228b22;">char</span> * <span style="color: #a0522d;">name</span>, <span style="color: #228b22;">TypeFlag</span> <span style="color: #a0522d;">flag</span> );

<span style="color: #b22222;">// </span><span style="color: #b22222;">Are param1 and param2 equal?</span>
<span style="color: #228b22;">bool</span>         <span style="color: #0000ff;">equalParameterDef</span>(  <span style="color: #228b22;">ParameterDef</span> <span style="color: #a0522d;">param1</span>, <span style="color: #228b22;">ParameterDef</span> <span style="color: #a0522d;">param2</span>);

<span style="color: #b22222;">// </span><span style="color: #b22222;">create a double parameter </span>
<span style="color: #228b22;">Parameter</span>    <span style="color: #0000ff;">mkDoubleParameter</span>(  <span style="color: #228b22;">ParameterDef</span> <span style="color: #a0522d;">def</span>, <span style="color: #228b22;">double</span> <span style="color: #a0522d;">value</span>);
<span style="color: #b22222;">// </span><span style="color: #b22222;">create a long parameter </span>
<span style="color: #228b22;">Parameter</span>    <span style="color: #0000ff;">mkLongParameter</span>(    <span style="color: #228b22;">ParameterDef</span> <span style="color: #a0522d;">def</span>, <span style="color: #228b22;">long</span>   <span style="color: #a0522d;">value</span>);
<span style="color: #b22222;">// </span><span style="color: #b22222;">create a string parameter </span>
<span style="color: #228b22;">Parameter</span>    <span style="color: #0000ff;">mkStringParameter</span>(  <span style="color: #228b22;">ParameterDef</span> <span style="color: #a0522d;">def</span>, <span style="color: #228b22;">char</span> * <span style="color: #a0522d;">value</span>);
<span style="color: #b22222;">// </span><span style="color: #b22222;">create a char parameter </span>
<span style="color: #228b22;">Parameter</span>    <span style="color: #0000ff;">mkCharParameter</span>(    <span style="color: #228b22;">ParameterDef</span> <span style="color: #a0522d;">def</span>, <span style="color: #228b22;">char</span>   <span style="color: #a0522d;">value</span>);
<span style="color: #b22222;">// </span><span style="color: #b22222;">return the name of a parameter's def</span>
<span style="color: #228b22;">char</span> *       <span style="color: #0000ff;">nameParameter</span>(      <span style="color: #228b22;">Parameter</span> <span style="color: #a0522d;">param</span> );
<span style="color: #b22222;">// </span><span style="color: #b22222;">return the type of a parameter from its def</span>
<span style="color: #228b22;">TypeFlag</span>     <span style="color: #0000ff;">typeParameter</span>(      <span style="color: #228b22;">Parameter</span> <span style="color: #a0522d;">param</span> );
<span style="color: #b22222;">// </span><span style="color: #b22222;">return the double value of a parameter</span>
<span style="color: #228b22;">double</span>       <span style="color: #0000ff;">doubleParameter</span>(    <span style="color: #228b22;">Parameter</span> <span style="color: #a0522d;">param</span> );
<span style="color: #b22222;">// </span><span style="color: #b22222;">return the long value of a parameter</span>
<span style="color: #228b22;">long</span>         <span style="color: #0000ff;">longParameter</span>(      <span style="color: #228b22;">Parameter</span> <span style="color: #a0522d;">param</span> );
<span style="color: #b22222;">// </span><span style="color: #b22222;">return the string value of a parameter</span>
<span style="color: #228b22;">char</span> *       <span style="color: #0000ff;">stringParameter</span>(    <span style="color: #228b22;">Parameter</span> <span style="color: #a0522d;">param</span> );
<span style="color: #b22222;">// </span><span style="color: #b22222;">return the char value of a parameter</span>
<span style="color: #228b22;">char</span>         <span style="color: #0000ff;">charParameter</span>(      <span style="color: #228b22;">Parameter</span> <span style="color: #a0522d;">param</span> );
<span style="color: #b22222;">// </span><span style="color: #b22222;">Are param1 and param2 equal?</span>
<span style="color: #228b22;">bool</span>         <span style="color: #0000ff;">equalParameter</span>(     <span style="color: #228b22;">Parameter</span> <span style="color: #a0522d;">param1</span>, <span style="color: #228b22;">Parameter</span> <span style="color: #a0522d;">param2</span>);
<span style="color: #b22222;">// </span><span style="color: #b22222;">Print parameters!</span>
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">printParams</span>(<span style="color: #228b22;">Parameter</span> * <span style="color: #a0522d;">params</span>, <span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">size</span>);
</pre>
</div>

<p>
3 includes 
</p>

<ul class="org-ul">
<li>w=3</li>
<li>z=0</li>
<li>coupling<sub>h</sub> = 1/(4*w + z)</li>
</ul>

<p>
ppdarray.h
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">"parameters.h"</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;inttypes.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>

<span style="color: #b22222;">// </span><span style="color: #b22222;">You need a guard here!</span>

<span style="color: #b22222;">// </span><span style="color: #b22222;">forward declaration</span>
<span style="color: #a020f0;">union</span> <span style="color: #228b22;">ppd_t</span>;
<span style="color: #b22222;">// </span><span style="color: #b22222;">This is an array of defs, params, or arrays</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">Assume you keep the same sort of values within this array</span>
<span style="color: #a020f0;">struct</span> <span style="color: #228b22;">ppd_array</span> {
  <span style="color: #a020f0;">union</span> <span style="color: #228b22;">ppd_t</span> * <span style="color: #a0522d;">params</span>; <span style="color: #b22222;">// </span><span style="color: #b22222;">A pointer to an array of ppd_t unions (PPD)</span>
  <span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">size</span>;
};
<span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">ppd_array</span> * <span style="color: #228b22;">PPDArray</span>;

<span style="color: #a020f0;">union</span> <span style="color: #228b22;">ppd_t</span> {
  <span style="color: #228b22;">ParameterDef</span>       <span style="color: #a0522d;">def</span>;
  <span style="color: #228b22;">Parameter</span>          <span style="color: #a0522d;">param</span>;
  <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">ppd_array</span> * <span style="color: #a0522d;">array</span>;
  <span style="color: #228b22;">int64_t</span>            <span style="color: #a0522d;">int64</span>;
  <span style="color: #228b22;">char</span>             * <span style="color: #a0522d;">str</span>;
};

<span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">union</span> <span style="color: #228b22;">ppd_t</span> <span style="color: #228b22;">PPD</span>;

<span style="color: #b22222;">// </span><span style="color: #b22222;">create PPDArray</span>
<span style="color: #228b22;">PPDArray</span> <span style="color: #0000ff;">createPPDArray</span>();
<span style="color: #b22222;">// </span><span style="color: #b22222;">get the number of elements in a PPDArray</span>
<span style="color: #228b22;">size_t</span> <span style="color: #0000ff;">sizePPDArray</span>(<span style="color: #228b22;">PPDArray</span> <span style="color: #a0522d;">array</span>);
<span style="color: #b22222;">// </span><span style="color: #b22222;">Free a PPD Array</span>
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">freePPDArray</span>(<span style="color: #228b22;">PPDArray</span> <span style="color: #a0522d;">array</span>);
<span style="color: #b22222;">// </span><span style="color: #b22222;">Free a PPD Array and all of its PPD Arrays (not recursive)</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">Frees an array of arrays, by freeing each contained array</span>
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">freeArrayPPDArray</span>(<span style="color: #228b22;">PPDArray</span> <span style="color: #a0522d;">array</span>);
<span style="color: #b22222;">// </span><span style="color: #b22222;">return a parameter def at index of PPDArray array</span>
<span style="color: #228b22;">ParameterDef</span> <span style="color: #0000ff;">parameterDefPPDArray</span>(<span style="color: #228b22;">PPDArray</span> <span style="color: #a0522d;">array</span>, <span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">index</span>);
<span style="color: #b22222;">// </span><span style="color: #b22222;">return a pointer to parameter def at index of PPDArray array</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">pretty unsafe</span>
<span style="color: #228b22;">ParameterDef</span> * <span style="color: #0000ff;">parameterDefRefPPDArray</span>(<span style="color: #228b22;">PPDArray</span> <span style="color: #a0522d;">array</span>, <span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">index</span>);
<span style="color: #b22222;">// </span><span style="color: #b22222;">return a parameter at index of PPDArray array</span>
<span style="color: #228b22;">Parameter</span> <span style="color: #0000ff;">parameterPPDArray</span>(<span style="color: #228b22;">PPDArray</span> <span style="color: #a0522d;">array</span>, <span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">index</span>);
<span style="color: #b22222;">// </span><span style="color: #b22222;">return a array at index of PPDArray array</span>
<span style="color: #228b22;">PPDArray</span> <span style="color: #0000ff;">arrayPPDArray</span>(<span style="color: #228b22;">PPDArray</span> <span style="color: #a0522d;">array</span>, <span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">index</span>);
<span style="color: #b22222;">// </span><span style="color: #b22222;">return an int64 at index of PPDArray array</span>
<span style="color: #228b22;">int64_t</span> <span style="color: #0000ff;">int64PPDArray</span>(<span style="color: #228b22;">PPDArray</span> <span style="color: #a0522d;">array</span>, <span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">index</span>);
<span style="color: #b22222;">// </span><span style="color: #b22222;">return a string at index of PPDArray array</span>
<span style="color: #228b22;">char</span> * <span style="color: #0000ff;">stringPPDArray</span>(<span style="color: #228b22;">PPDArray</span> <span style="color: #a0522d;">array</span>, <span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">index</span>);
<span style="color: #b22222;">// </span><span style="color: #b22222;">at index of array set the int64 value to </span>
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">setInt64PPDArray</span>(<span style="color: #228b22;">PPDArray</span> <span style="color: #a0522d;">array</span>, <span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">index</span>, <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">value</span>);
<span style="color: #b22222;">// </span><span style="color: #b22222;">extend PPDArray 1 slot and put this PPD into that slot</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">may use realloc!</span>
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">addPPDPPDArray</span>(<span style="color: #228b22;">PPDArray</span> <span style="color: #a0522d;">array</span>, <span style="color: #228b22;">PPD</span> <span style="color: #a0522d;">defOrParam</span>);
<span style="color: #b22222;">// </span><span style="color: #b22222;">extend PPDArray 1 slot and put this ParameterDef into that slot</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">may use realloc!</span>
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">addDefPPDArray</span>(<span style="color: #228b22;">PPDArray</span> <span style="color: #a0522d;">array</span>, <span style="color: #228b22;">ParameterDef</span> <span style="color: #a0522d;">def</span>);
<span style="color: #b22222;">// </span><span style="color: #b22222;">extend PPDArray 1 slot and put this Parameter into that slot</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">may use realloc!</span>
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">addParamPPDArray</span>(<span style="color: #228b22;">PPDArray</span> <span style="color: #a0522d;">array</span>, <span style="color: #228b22;">Parameter</span> <span style="color: #a0522d;">param</span>);
<span style="color: #b22222;">// </span><span style="color: #b22222;">extend PPDArray 1 slot and put this Array newArray into that slot</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">may use realloc!</span>
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">addPPDArrayPPDArray</span>(<span style="color: #228b22;">PPDArray</span> <span style="color: #a0522d;">array</span>, <span style="color: #228b22;">PPDArray</span> <span style="color: #a0522d;">newArray</span>  );
<span style="color: #b22222;">// </span><span style="color: #b22222;">extend PPDArray 1 slot and put this int64 into that slot</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">may use realloc!</span>
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">addInt64PPDArray</span>(<span style="color: #228b22;">PPDArray</span> <span style="color: #a0522d;">array</span>, <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">int64</span>  );
<span style="color: #b22222;">// </span><span style="color: #b22222;">extend PPDArray 1 slot and put this string into that slot</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">may use realloc!</span>
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">addStringPPDArray</span>(<span style="color: #228b22;">PPDArray</span> <span style="color: #a0522d;">array</span>, <span style="color: #228b22;">char</span> * <span style="color: #a0522d;">str</span> );
</pre>
</div>

<p>
3 includes &amp; 3 reference to int64<sub>t</sub>, Parameter and ParameterDef
</p>

<ul class="org-ul">
<li>w=3</li>
<li>z=3</li>
<li>coupling<sub>h</sub> = 1/(4*w + z)</li>
</ul>
</div>
</li>
</ol>
</li>
</ol>
</div>
</div>
