week12/presentation.org
** Cohesion 

Cohesion is about how relevant code is to itself. A highly cohesive
module is topical, that is about it is about a single topic.

stdlib.h is low cohesion because it does too many things. From memory
allocation to random number generation stdlib.h does too much. It is
not cohesive.

math.h has better cohesion than stdlib.h but its cohesion is
considered low because the functions are just logically related to
math and floating point operations. In fact many of the operations
could be refactored and moved into floating point specific libraries.

parameters.h is very cohesive, it only deals with parameters and
parameter defs. Its responsibilities are the creation of parameters
and parameter defs. Its only weird responsibility is for printing
parameters which is probably its least cohesive part.

High cohesion is good because it means the module is topical and
relevant. It doesn't have any weird responsibilities. It won't have to
change to address extra responsibilities. High cohesion typically
limits coupling.

To calculate cohesion there's many metrics suggested but I suggest
reading the module and writing bullet points about responsibilities.
Let's look at ppdarray.c:
  - representation: structs for PPD array and containers
  - creation & allocation
  - destruction & deallocation
  - array access
  - array appending

So 5 responsibilities. Let's look at checkinput.h:
  - error detection
  - error reporting

Checkinput.h is clearly more cohesive than PPDArray mostly because it
has less responsibilities. Even though both are very cohesive modules

My stdio.h has 122 externs defined within it. It is way less cohesive
than PPDArray but all of stdio.h's externs are about io to terminals
and files. So it is still logically cohesive. 

My stdlib.h has 153 externs defined within it. But it handles memory
allocation, temporary files, environment variables, sorting, binary
search, converting floats to strings, etc. No cohesive and often
called coincidental cohesion (aka you're lucky if it is cohesive).

