week12/presentation.html

<div id="outline-container-orgb222758" class="outline-4">
<h4 id="orgb222758"><span class="section-number-4">1.9.1</span> McCabe's Cyclometic Complexity</h4>
<div class="outline-text-4" id="text-1-9-1">
<p>
McCabe's Cyclometic Complexity is [McCabe76] the number of unique
paths through a module. The idea is that a module is complicated
(complex) if there's lots of routes through the module.
</p>

<p>
Programmers worry about complicated code because it can become a
maintainability nightmare. It is hard to read and understand and can
have lots of corner cases making it very hard to test. This means it
is probably less reliable and trustable. Typically we correlate
complicated with the idea that it is not maintainable. 
</p>

<p>
You had to deal with McCabe's cyclometic complexity ever since we
forced OCLint on you.
</p>

<p>
Typically for a subroutine McCabes is calculated as (P=1):
</p>

<p>
MCC = E - N + 2P
MCC = E - N + 2
</p>

<p>
Where E is the number of edges in a module (directed edges) and N is
the number of nodes. 
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">input</span> = 0;
    scanf(<span style="color: #8b2252;">"%d"</span>, &amp;input);
    <span style="color: #a020f0;">return</span> 5 * input;
}
</pre>
</div>

<p>
This module has 3 nodes 2 edges and 1 exit:
</p>
<pre class="example">
int input = 0;
|
V
scanf("%d", &amp;input);
|
V
return 5 * input;
</pre>

<p>
MCC = 2 - 3 + 2 = 1
</p>

<p>
McCabes argued that subroutines or modules with complexity greater
than 10 should be split into smaller modules.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;inttypes.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>
<span style="color: #228b22;">int</span> <span style="color: #0000ff;">sum</span>(<span style="color: #228b22;">int</span> * <span style="color: #a0522d;">array</span>, <span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">n</span>) {
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">sum</span> = 0;
    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">i</span> = 0 ; i &lt; n ; i++ ) {
        sum += array[i];
    }
    <span style="color: #a020f0;">return</span> sum;
}
</pre>
</div>

<pre class="example">
int sum = 0;
|
V
for (size_t i = 0 ; i &lt; n ; i++ ) {//&lt;-+ // we could split this up
     |                                 |
     V                                 |
    sum += array[i]                    |
     |                                 |
     V                                 |
} // ----------------------------------+
|
V
return sum;
</pre>

<p>
E = 5
N = 5
MCC = E - N + 2 = 2
</p>

<p>
So that 1 for loop is worth 1
</p>


<p>
OK now let's do another sum that works but it more "complex".
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;inttypes.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>
<span style="color: #228b22;">int</span> <span style="color: #0000ff;">sum</span>(<span style="color: #228b22;">int</span> * <span style="color: #a0522d;">array</span>, <span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">n</span>) {
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">sum</span> = 0; <span style="color: #b22222;">// </span><span style="color: #b22222;">N+=1</span>
    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">i</span> = 0 ; i &lt; n ; i+=4 ) { <span style="color: #b22222;">// </span><span style="color: #b22222;">N+=1</span>
        sum += array[i]; <span style="color: #b22222;">// </span><span style="color: #b22222;">N+=1</span>
    } <span style="color: #b22222;">// </span><span style="color: #b22222;">N+=1 E+=1</span>
    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">i</span> = 1 ; i &lt; n ; i+=4 ) { <span style="color: #b22222;">// </span><span style="color: #b22222;">N+=1</span>
        sum += array[i]; <span style="color: #b22222;">// </span><span style="color: #b22222;">N+=1</span>
    } <span style="color: #b22222;">// </span><span style="color: #b22222;">N+=1 E+=1</span>
    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">i</span> = 2 ; i &lt; n ; i+=4 ) { <span style="color: #b22222;">// </span><span style="color: #b22222;">N+=1</span>
        sum += array[i]; <span style="color: #b22222;">// </span><span style="color: #b22222;">N+=1</span>
    } <span style="color: #b22222;">// </span><span style="color: #b22222;">N+=1 E+=1</span>
    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">i</span> = 3 ; i &lt; n ; i+=4 ) { <span style="color: #b22222;">// </span><span style="color: #b22222;">N+=1</span>
        sum += array[i]; <span style="color: #b22222;">// </span><span style="color: #b22222;">N+=1</span>
    } <span style="color: #b22222;">// </span><span style="color: #b22222;">N+=1 E+=1</span>
    <span style="color: #a020f0;">return</span> sum; <span style="color: #b22222;">// </span><span style="color: #b22222;">N+=1</span>
}
</pre>
</div>
<p>
E=17
N=14
MCC=17-14+2 = 5
</p>

<p>
Effectively McCabes is close to the 1 + the number of branch points in
a program. So I could estimate the complexity of that program by
counting the number of if, while, do, for statements. This means I can
skip a lot of the complicated modelling and just count those.
</p>


<div class="org-src-container">
<pre class="src src-C"><span style="color: #228b22;">int</span> <span style="color: #0000ff;">passCode</span>(<span style="color: #228b22;">int</span> * <span style="color: #a0522d;">code</span>) {

    <span style="color: #a020f0;">if</span> ( code[0] == <span style="color: #8b2252;">'C'</span> ) { <span style="color: #b22222;">// </span><span style="color: #b22222;">N+=1 E+=2</span>
        <span style="color: #a020f0;">if</span> ( code[1] == <span style="color: #8b2252;">'R'</span> ) { <span style="color: #b22222;">// </span><span style="color: #b22222;">N+=1 E+=2</span>
            <span style="color: #a020f0;">if</span> ( code[2] == <span style="color: #8b2252;">'E'</span> ) { <span style="color: #b22222;">// </span><span style="color: #b22222;">N+=1 E+=2</span>
                <span style="color: #a020f0;">if</span> ( code[3] == <span style="color: #8b2252;">'D'</span> ) { <span style="color: #b22222;">// </span><span style="color: #b22222;">N+=1 E+=2</span>
                    <span style="color: #a020f0;">if</span> ( code[4] == <span style="color: #8b2252;">'I'</span> ) { <span style="color: #b22222;">// </span><span style="color: #b22222;">N+=1 E+=2</span>
                        <span style="color: #a020f0;">if</span> ( code[5] == <span style="color: #8b2252;">'T'</span> ) { <span style="color: #b22222;">// </span><span style="color: #b22222;">N+=1 E+=2</span>
                            <span style="color: #a020f0;">return</span> 1; <span style="color: #b22222;">// </span><span style="color: #b22222;">N+=1</span>
                        }
                    }
                }
            }
        }
    }
    <span style="color: #a020f0;">return</span> 0; <span style="color: #b22222;">// </span><span style="color: #b22222;">N+=1</span>
}
</pre>
</div>

<p>
E = 13
N = 8
MCC = 13 - 8 + 2 = 7
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #228b22;">int</span> <span style="color: #0000ff;">passCode</span>(<span style="color: #228b22;">int</span> * <span style="color: #a0522d;">code</span>) {
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">sum</span> = 0; <span style="color: #b22222;">// </span><span style="color: #b22222;">N+=1 E+=1</span>
    sum += code[0] == <span style="color: #8b2252;">'C'</span>; <span style="color: #b22222;">// </span><span style="color: #b22222;">N+=1 E+=1</span>
    sum += code[1] == <span style="color: #8b2252;">'R'</span>; <span style="color: #b22222;">// </span><span style="color: #b22222;">N+=1 E+=1</span>
    sum += code[2] == <span style="color: #8b2252;">'E'</span>; <span style="color: #b22222;">// </span><span style="color: #b22222;">N+=1 E+=1</span>
    sum += code[3] == <span style="color: #8b2252;">'D'</span>; <span style="color: #b22222;">// </span><span style="color: #b22222;">N+=1 E+=1</span>
    sum += code[4] == <span style="color: #8b2252;">'I'</span>; <span style="color: #b22222;">// </span><span style="color: #b22222;">N+=1 E+=1</span>
    sum += code[5] == <span style="color: #8b2252;">'T'</span>; <span style="color: #b22222;">// </span><span style="color: #b22222;">N+=1 E+=1</span>
    <span style="color: #a020f0;">return</span> sum==6; <span style="color: #b22222;">// </span><span style="color: #b22222;">N+=1</span>
}
</pre>
</div>

<p>
MCC = 7 - 8 + 2 = 1
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #228b22;">int</span> <span style="color: #0000ff;">passCode</span>(<span style="color: #228b22;">int</span> * <span style="color: #a0522d;">code</span>) {
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">sum</span> = 0; <span style="color: #b22222;">// </span><span style="color: #b22222;">N+=1 E+=1</span>
    <span style="color: #a020f0;">if</span> (code[0] == <span style="color: #8b2252;">'C'</span>) sum++; <span style="color: #b22222;">// </span><span style="color: #b22222;">N+=2 E+=3</span>
    <span style="color: #b22222;">// </span><span style="color: #b22222;">it's E+3 because:</span>
    <span style="color: #b22222;">// </span><span style="color: #b22222;">the if statement condition is false is 1 path</span>
    <span style="color: #b22222;">// </span><span style="color: #b22222;">and you need 2 edges to, 1 to reach sum++ and 1 </span>
    <span style="color: #b22222;">// </span><span style="color: #b22222;">to exit the if statement</span>
    <span style="color: #a020f0;">if</span> (code[1] == <span style="color: #8b2252;">'R'</span>) sum++; <span style="color: #b22222;">// </span><span style="color: #b22222;">N+=2 E+=3</span>
    <span style="color: #a020f0;">if</span> (code[2] == <span style="color: #8b2252;">'E'</span>) sum++; <span style="color: #b22222;">// </span><span style="color: #b22222;">N+=2 E+=3</span>
    <span style="color: #a020f0;">if</span> (code[3] == <span style="color: #8b2252;">'D'</span>) sum++; <span style="color: #b22222;">// </span><span style="color: #b22222;">N+=2 E+=3</span>
    <span style="color: #a020f0;">if</span> (code[4] == <span style="color: #8b2252;">'I'</span>) sum++; <span style="color: #b22222;">// </span><span style="color: #b22222;">N+=2 E+=3</span>
    <span style="color: #a020f0;">if</span> (code[5] == <span style="color: #8b2252;">'T'</span>) sum++; <span style="color: #b22222;">// </span><span style="color: #b22222;">N+=2 E+=3</span>
    <span style="color: #a020f0;">return</span> sum==6; <span style="color: #b22222;">// </span><span style="color: #b22222;">N+=1</span>
}
</pre>
</div>

<p>
N = 14
E = 19
MCC = 19 - 14 + 2 = 7
</p>

<p>
If you want to use OCLint to print MCCabe's just force the threshold
</p>

<p>
Using the `-rc CYCLOMATIC<sub>COMPLEXITY</sub>=0` argument OCLint will print MCC
for all programs.
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #a020f0;">for</span> file<span style="color: #a020f0;"> in</span> sum.c sum4.c passcodedeep.c passcodesum.c passcodeifsum.c
<span style="color: #a020f0;">do</span>
<span style="color: #483d8b;">echo</span> $<span style="color: #a0522d;">file</span>
/usr/local/bin/oclint --disable-rule=UselessParentheses <span style="color: #8b2252;">\</span>
   -rc <span style="color: #a0522d;">CYCLOMATIC_COMPLEXITY</span>=0  $<span style="color: #a0522d;">file</span> --  <span style="color: #8b2252;">\</span>
   -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3  <span style="color: #8b2252;">\</span>
   -c $<span style="color: #a0522d;">file</span> 
<span style="color: #a020f0;">done</span>
<span style="color: #483d8b;">echo</span> good
</pre>
</div>

<pre class="example">
sum.c


OCLint Report

Summary: TotalFiles=1 FilesWithViolations=1 P1=0 P2=1 P3=1 

/home/hindle1/projects/CMPUT201W20/2020-01/CMPUT201W20B2-public/week12/sum.c:3:22: short variable name [naming|P3] Length of variable name `n` is 1, which is shorter than the threshold of 3
/home/hindle1/projects/CMPUT201W20/2020-01/CMPUT201W20B2-public/week12/sum.c:3:1: high cyclomatic complexity [size|P2] Cyclomatic Complexity Number 2 exceeds limit of 0

[OCLint (http://oclint.org) v0.15]
sum4.c


OCLint Report

Summary: TotalFiles=1 FilesWithViolations=1 P1=0 P2=1 P3=1 

/home/hindle1/projects/CMPUT201W20/2020-01/CMPUT201W20B2-public/week12/sum4.c:3:22: short variable name [naming|P3] Length of variable name `n` is 1, which is shorter than the threshold of 3
/home/hindle1/projects/CMPUT201W20/2020-01/CMPUT201W20B2-public/week12/sum4.c:3:1: high cyclomatic complexity [size|P2] Cyclomatic Complexity Number 5 exceeds limit of 0

[OCLint (http://oclint.org) v0.15]
passcodedeep.c


OCLint Report

Summary: TotalFiles=1 FilesWithViolations=1 P1=0 P2=1 P3=7 

/home/hindle1/projects/CMPUT201W20/2020-01/CMPUT201W20B2-public/week12/passcodedeep.c:1:26: deep nested block [size|P3] Block depth of 7 exceeds limit of 5
/home/hindle1/projects/CMPUT201W20/2020-01/CMPUT201W20B2-public/week12/passcodedeep.c:3:27: deep nested block [size|P3] Block depth of 6 exceeds limit of 5
/home/hindle1/projects/CMPUT201W20/2020-01/CMPUT201W20B2-public/week12/passcodedeep.c:3:5: collapsible if statements [basic|P3] 
/home/hindle1/projects/CMPUT201W20/2020-01/CMPUT201W20B2-public/week12/passcodedeep.c:4:9: collapsible if statements [basic|P3] 
/home/hindle1/projects/CMPUT201W20/2020-01/CMPUT201W20B2-public/week12/passcodedeep.c:5:13: collapsible if statements [basic|P3] 
/home/hindle1/projects/CMPUT201W20/2020-01/CMPUT201W20B2-public/week12/passcodedeep.c:6:17: collapsible if statements [basic|P3] 
/home/hindle1/projects/CMPUT201W20/2020-01/CMPUT201W20B2-public/week12/passcodedeep.c:7:21: collapsible if statements [basic|P3] 
/home/hindle1/projects/CMPUT201W20/2020-01/CMPUT201W20B2-public/week12/passcodedeep.c:1:1: high cyclomatic complexity [size|P2] Cyclomatic Complexity Number 7 exceeds limit of 0

[OCLint (http://oclint.org) v0.15]
passcodesum.c


OCLint Report

Summary: TotalFiles=1 FilesWithViolations=1 P1=0 P2=1 P3=0 

/home/hindle1/projects/CMPUT201W20/2020-01/CMPUT201W20B2-public/week12/passcodesum.c:1:1: high cyclomatic complexity [size|P2] Cyclomatic Complexity Number 1 exceeds limit of 0

[OCLint (http://oclint.org) v0.15]
passcodeifsum.c


OCLint Report

Summary: TotalFiles=1 FilesWithViolations=1 P1=0 P2=1 P3=0 

/home/hindle1/projects/CMPUT201W20/2020-01/CMPUT201W20B2-public/week12/passcodeifsum.c:1:1: high cyclomatic complexity [size|P2] Cyclomatic Complexity Number 7 exceeds limit of 0

[OCLint (http://oclint.org) v0.15]
good
</pre>
</div>

<ol class="org-ol">
