week12/presentation.org
**** OCLint

How does OCLint calculate Cyclometic complexity?
https://github.com/oclint/oclint/blob/master/oclint-rules/rules/size/CyclomaticComplexityRule.cpp
https://github.com/oclint/oclint/blob/master/oclint-metrics/lib/CyclomaticComplexityMetric.cpp

It traverses the code as a tree, and counts all conditions, whiles,
do, cases, fors, and if statements and adds 1.


oclint --disable-rule=UselessParentheses -rc CYCLOMATIC_COMPLEXITY=0 

**** Criticism of McCabe's

McCabes is correlated with lines of code, so it is effectively a size
measure. We know that if each line has a probability of being buggy
then more lines implies more bugs. McCabes doesn't really help us
here. OClint has NCSS which is a lines of code measure.

McCabes ignores function pointers and dot operators. So dynamic code
is not counted. McCabes also ignores delegation functions (like a
function with a case statement) that you might call, effectively
making highly divergent code paths. 

McCabes typically ignores multi-module dependencies.

McCabes under counts paths through a program. The NPath metric can
count the paths.

*** Refs

[Stevens74] W. P. Stevens, G. J. Myers and L. L. Constantine, "Structured design,"
in IBM Systems Journal, vol. 13, no. 2, pp. 115-139, 1974.
https://ieeexplore.ieee.org/document/5388187

[Pressman09] Roger Pressman. 2009. Software Engineering: A Practitioner’s Approach
(7th. ed.). McGraw-Hill, Inc., USA.

[DHA95] Dhama, H., “Quantitative Models of Cohesion and Coupling in Software,”
Journal of Systems and Software, vol. 29, no. 4, April 1995.

[McCabe76] McCabe (December 1976). "A Complexity Measure". IEEE Transactions on
Software Engineering (4): 308–320. doi:10.1109/tse.1976.233837


** Big Programs
*** DOOM

#+begin_example
=================     ===============     ===============   ========  ========
\\ . . . . . . .\\   //. . . . . . .\\   //. . . . . . .\\  \\. . .\\// . . //
||. . ._____. . .|| ||. . ._____. . .|| ||. . ._____. . .|| || . . .\/ . . .||
|| . .||   ||. . || || . .||   ||. . || || . .||   ||. . || ||. . . . . . . ||
||. . ||   || . .|| ||. . ||   || . .|| ||. . ||   || . .|| || . | . . . . .||
|| . .||   ||. _-|| ||-_ .||   ||. . || || . .||   ||. _-|| ||-_.|\ . . . . ||
||. . ||   ||-'  || ||  `-||   || . .|| ||. . ||   ||-'  || ||  `|\_ . .|. .||
|| . _||   ||    || ||    ||   ||_ . || || . _||   ||    || ||   |\ `-_/| . ||
||_-' ||  .|/    || ||    \|.  || `-_|| ||_-' ||  .|/    || ||   | \  / |-_.||
||    ||_-'      || ||      `-_||    || ||    ||_-'      || ||   | \  / |  `||
||    `'         || ||         `'    || ||    `'         || ||   | \  / |   ||
||            .===' `===.         .==='.`===.         .===' /==. |  \/  |   ||
||         .=='   \_|-_ `===. .==='   _|_   `===. .===' _-|/   `==  \/  |   ||
||      .=='    _-'    `-_  `='    _-'   `-_    `='  _-'   `-_  /|  \/  |   ||
||   .=='    _-'          `-__\._-'         `-_./__-'         `' |. /|  |   ||
||.=='    _-'                                                     `' |  /==.||
=='    _-'                                                            \/   `==
\   _-'                                                                `-_   /
 `''                                                                      ``'
#+end_example

*** License

The license of code from doom is under the Doom License.

https://github.com/id-Software/DOOM/blob/master/linuxdoom-1.10/DOOMLIC.TXT

This is not the GPL release :(

