week12/presentation.html
<li><a id="orgda41c1e"></a>OCLint<br />
<div class="outline-text-5" id="text-1-9-1-1">
<p>
How does OCLint calculate Cyclometic complexity?
<a href="https://github.com/oclint/oclint/blob/master/oclint-rules/rules/size/CyclomaticComplexityRule.cpp">https://github.com/oclint/oclint/blob/master/oclint-rules/rules/size/CyclomaticComplexityRule.cpp</a>
<a href="https://github.com/oclint/oclint/blob/master/oclint-metrics/lib/CyclomaticComplexityMetric.cpp">https://github.com/oclint/oclint/blob/master/oclint-metrics/lib/CyclomaticComplexityMetric.cpp</a>
</p>

<p>
It traverses the code as a tree, and counts all conditions, whiles,
do, cases, fors, and if statements and adds 1.
</p>


<p>
oclint &#x2013;disable-rule=UselessParentheses -rc CYCLOMATIC<sub>COMPLEXITY</sub>=0 
</p>
</div>
</li>

<li><a id="org3d270b2"></a>Criticism of McCabe's<br />
<div class="outline-text-5" id="text-1-9-1-2">
<p>
McCabes is correlated with lines of code, so it is effectively a size
measure. We know that if each line has a probability of being buggy
then more lines implies more bugs. McCabes doesn't really help us
here. OClint has NCSS which is a lines of code measure.
</p>

<p>
McCabes ignores function pointers and dot operators. So dynamic code
is not counted. McCabes also ignores delegation functions (like a
function with a case statement) that you might call, effectively
making highly divergent code paths. 
</p>

<p>
McCabes typically ignores multi-module dependencies.
</p>

<p>
McCabes under counts paths through a program. The NPath metric can
count the paths.
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-orga0f69a0" class="outline-4">
<h4 id="orga0f69a0"><span class="section-number-4">1.9.2</span> Refs</h4>
<div class="outline-text-4" id="text-1-9-2">
<p>
[Stevens74] W. P. Stevens, G. J. Myers and L. L. Constantine, "Structured design,"
in IBM Systems Journal, vol. 13, no. 2, pp. 115-139, 1974.
<a href="https://ieeexplore.ieee.org/document/5388187">https://ieeexplore.ieee.org/document/5388187</a>
</p>

<p>
[Pressman09] Roger Pressman. 2009. Software Engineering: A Practitioners Approach
(7th. ed.). McGraw-Hill, Inc., USA.
</p>

<p>
[DHA95] Dhama, H., Quantitative Models of Cohesion and Coupling in Software,
Journal of Systems and Software, vol. 29, no. 4, April 1995.
</p>

<p>
[McCabe76] McCabe (December 1976). "A Complexity Measure". IEEE Transactions on
Software Engineering (4): 308320. <a href="10.1109/tse.1976.233837">10.1109/tse.1976.233837</a>
</p>
</div>
</div>
</div>


<div id="outline-container-org538a79d" class="outline-3">
<h3 id="org538a79d"><span class="section-number-3">1.10</span> Big Programs</h3>
<div class="outline-text-3" id="text-1-10">
</div>
<div id="outline-container-orge47eeab" class="outline-4">
<h4 id="orge47eeab"><span class="section-number-4">1.10.1</span> DOOM</h4>
<div class="outline-text-4" id="text-1-10-1">
<pre class="example">
=================     ===============     ===============   ========  ========
\\ . . . . . . .\\   //. . . . . . .\\   //. . . . . . .\\  \\. . .\\// . . //
||. . ._____. . .|| ||. . ._____. . .|| ||. . ._____. . .|| || . . .\/ . . .||
|| . .||   ||. . || || . .||   ||. . || || . .||   ||. . || ||. . . . . . . ||
||. . ||   || . .|| ||. . ||   || . .|| ||. . ||   || . .|| || . | . . . . .||
|| . .||   ||. _-|| ||-_ .||   ||. . || || . .||   ||. _-|| ||-_.|\ . . . . ||
||. . ||   ||-'  || ||  `-||   || . .|| ||. . ||   ||-'  || ||  `|\_ . .|. .||
|| . _||   ||    || ||    ||   ||_ . || || . _||   ||    || ||   |\ `-_/| . ||
||_-' ||  .|/    || ||    \|.  || `-_|| ||_-' ||  .|/    || ||   | \  / |-_.||
||    ||_-'      || ||      `-_||    || ||    ||_-'      || ||   | \  / |  `||
||    `'         || ||         `'    || ||    `'         || ||   | \  / |   ||
||            .===' `===.         .==='.`===.         .===' /==. |  \/  |   ||
||         .=='   \_|-_ `===. .==='   _|_   `===. .===' _-|/   `==  \/  |   ||
||      .=='    _-'    `-_  `='    _-'   `-_    `='  _-'   `-_  /|  \/  |   ||
||   .=='    _-'          `-__\._-'         `-_./__-'         `' |. /|  |   ||
||.=='    _-'                                                     `' |  /==.||
=='    _-'                                                            \/   `==
\   _-'                                                                `-_   /
 `''                                                                      ``'
</pre>
</div>
</div>

<div id="outline-container-org264d649" class="outline-4">
<h4 id="org264d649"><span class="section-number-4">1.10.2</span> License</h4>
<div class="outline-text-4" id="text-1-10-2">
<p>
The license of code from doom is under the Doom License.
</p>

<p>
<a href="https://github.com/id-Software/DOOM/blob/master/linuxdoom-1.10/DOOMLIC.TXT">https://github.com/id-Software/DOOM/blob/master/linuxdoom-1.10/DOOMLIC.TXT</a>
</p>

<p>
This is not the GPL release :(
</p>
</div>
</div>
