week12/presentation.html

<div id="outline-container-org944ceae" class="outline-4">
<h4 id="org944ceae"><span class="section-number-4">1.10.3</span> Discussion</h4>
<div class="outline-text-4" id="text-1-10-3">
<p>
iD software 1995 game doom.
</p>

<p>
<a href="https://github.com/id-Software/DOOM/tree/master/linuxdoom-1.10">https://github.com/id-Software/DOOM/tree/master/linuxdoom-1.10</a>
</p>

<p>
General tips on code reading:
</p>

<ul class="org-ul">
<li>Go to the build system, how is the program built
<ul class="org-ul">
<li>What are the main entries to the program?</li>
<li>Start with the makefiles and similar build files</li>
<li><a href="https://github.com/id-Software/DOOM/blob/master/linuxdoom-1.10/Makefile">https://github.com/id-Software/DOOM/blob/master/linuxdoom-1.10/Makefile</a>
<ul class="org-ul">
<li><a href="file:///home/hindle1/src/DOOM/linuxdoom-1.10/Makefile">Makefile</a></li>
</ul></li>
<li><a href="https://github.com/id-Software/DOOM/blob/master/linuxdoom-1.10/i_main.c">https://github.com/id-Software/DOOM/blob/master/linuxdoom-1.10/i_main.c</a>
<ul class="org-ul">
<li><a href="file:///home/hindle1/src/DOOM/linuxdoom-1.10/i_main.c">i<sub>main.c</sub></a></li>
</ul></li>
</ul></li>
<li>.h files give an overview of what is important in each module
<ul class="org-ul">
<li><a href="https://github.com/id-Software/DOOM/blob/master/linuxdoom-1.10/d_main.h">https://github.com/id-Software/DOOM/blob/master/linuxdoom-1.10/d_main.h</a>
<ul class="org-ul">
<li><a href="file:///home/hindle1/src/DOOM/linuxdoom-1.10/d_main.h">d<sub>main.h</sub></a></li>
</ul></li>
<li><a href="https://github.com/id-Software/DOOM/blob/master/linuxdoom-1.10/d_main.c">https://github.com/id-Software/DOOM/blob/master/linuxdoom-1.10/d_main.c</a>
<ul class="org-ul">
<li><a href="file:///home/hindle1/src/DOOM/linuxdoom-1.10/d_main.c">d<sub>main.c</sub></a></li>
</ul></li>
</ul></li>
<li>Read descriptions of functions and modules</li>
<li><p>
Use grep or other tools to search across the source code
</p>
<ul class="org-ul">
<li>E.g. let's look at blitting (rapid copying of data)</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">grep -i blit ~/src/DOOM/linuxdoom-1.10/*.h
grep -i blit ~/src/DOOM/linuxdoom-1.10/*.c
</pre>
</div>

<pre class="example">
/home/hindle1/src/DOOM/linuxdoom-1.10/doomstat.h:extern  boolean		noblit;
/home/hindle1/src/DOOM/linuxdoom-1.10/i_video.h:void I_UpdateNoBlit (void);
/home/hindle1/src/DOOM/linuxdoom-1.10/r_data.h:// Retrieve column data for span blitting.
/home/hindle1/src/DOOM/linuxdoom-1.10/r_draw.h:// The span blitting interface.
/home/hindle1/src/DOOM/linuxdoom-1.10/r_draw.h:// Span blitting for rows, floor/ceiling.
/home/hindle1/src/DOOM/linuxdoom-1.10/v_video.h://	Functions to blit a block to the screen.
/home/hindle1/src/DOOM/linuxdoom-1.10/d_main.c:    I_UpdateNoBlit ();
/home/hindle1/src/DOOM/linuxdoom-1.10/d_main.c:	I_FinishUpdate ();              // page flip or blit buffer
/home/hindle1/src/DOOM/linuxdoom-1.10/d_main.c:	I_UpdateNoBlit ();
/home/hindle1/src/DOOM/linuxdoom-1.10/d_main.c:	I_FinishUpdate ();                      // page flip or blit buffer
/home/hindle1/src/DOOM/linuxdoom-1.10/g_game.c:boolean         noblit;                 // for comparative timing purposes 
/home/hindle1/src/DOOM/linuxdoom-1.10/g_game.c:    noblit = M_CheckParm ("-noblit"); 
/home/hindle1/src/DOOM/linuxdoom-1.10/i_video.c:// I_UpdateNoBlit
/home/hindle1/src/DOOM/linuxdoom-1.10/i_video.c:void I_UpdateNoBlit (void)
/home/hindle1/src/DOOM/linuxdoom-1.10/i_video.c:    // scales the screen size before blitting it
/home/hindle1/src/DOOM/linuxdoom-1.10/m_menu.c:// but before it has been blitted.
/home/hindle1/src/DOOM/linuxdoom-1.10/v_video.c://	Functions to blit a block to the screen.
</pre></li>
<li><p>
Look at the file names! Sometimes they tell you a lot!
</p>

<p>
This doom source code is organized by prefixes. These indicate
grouping of modules.
</p>

<p>
From DoomWiki contributors, 1999, Doom source code, <a href="https://doomwiki.org/wiki/Doom_source_code">https://doomwiki.org/wiki/Doom_source_code</a>
</p>
<pre class="example">
AM_*
    Automap code
D_*
    Initialisation/general code
F_*
    "Finale" (end of game) and "screen melt" code.
G_*
    Main game loop/control
HU_*
    Heads-up display
I_*
    System-specific code
M_*
    Miscellaneous (includes the menu)
P_*
    Game logic/behaviour
R_*
    Rendering engine
S_*
    Sound code
ST_*
    Status bar
V_*
    General graphic rendering
WI_*
    End-of level "intermission" screen
W_*
    WAD file loading
Z_*
    Zone memory allocation system

The following are common prefixes for functions, although they do not denote a particular subsystem, and there are no files with these prefixes:

A_*
    Action functions invoked in sprite movement frames (these are the functions used in Dehacked "code pointers")
PIT_*
    Callback functions passed to P_BlockThingsIterator (see p_maputl.c)
T_*
    "Thinker" functions set to be called each clock tic for some purpose (eg, moving platforms or flickering lights)
</pre></li>

<li><p>
Memory allocation is always interesting in a C program
</p>

<div class="org-src-container">
<pre class="src src-sh">grep malloc ~/src/DOOM/linuxdoom-1.10/*.h
grep malloc ~/src/DOOM/linuxdoom-1.10/*.c
</pre>
</div>

<pre class="example">
/home/hindle1/src/DOOM/linuxdoom-1.10/i_system.h:// to get the ammount of memory to malloc
/home/hindle1/src/DOOM/linuxdoom-1.10/i_system.h:// just mallocs under unix
/home/hindle1/src/DOOM/linuxdoom-1.10/d_main.c:    newfile = malloc (strlen(file)+1);
/home/hindle1/src/DOOM/linuxdoom-1.10/d_main.c:    doom2wad = malloc(strlen(doomwaddir)+1+9+1);
/home/hindle1/src/DOOM/linuxdoom-1.10/d_main.c:    doomuwad = malloc(strlen(doomwaddir)+1+8+1);
/home/hindle1/src/DOOM/linuxdoom-1.10/d_main.c:    doomwad = malloc(strlen(doomwaddir)+1+8+1);
/home/hindle1/src/DOOM/linuxdoom-1.10/d_main.c:    doom1wad = malloc(strlen(doomwaddir)+1+9+1);
/home/hindle1/src/DOOM/linuxdoom-1.10/d_main.c:    // Insufficient malloc, caused spurious realloc errors.
/home/hindle1/src/DOOM/linuxdoom-1.10/d_main.c:    plutoniawad = malloc(strlen(doomwaddir)+1+/*9*/12+1);
/home/hindle1/src/DOOM/linuxdoom-1.10/d_main.c:    tntwad = malloc(strlen(doomwaddir)+1+9+1);
/home/hindle1/src/DOOM/linuxdoom-1.10/d_main.c:    doom2fwad = malloc(strlen(doomwaddir)+1+10+1);
/home/hindle1/src/DOOM/linuxdoom-1.10/d_main.c:	    file = malloc (size);
/home/hindle1/src/DOOM/linuxdoom-1.10/d_main.c:	    myargv = malloc(sizeof(char *)*MAXARGVS);
/home/hindle1/src/DOOM/linuxdoom-1.10/i_net.c:    doomcom = malloc (sizeof (*doomcom) );
/home/hindle1/src/DOOM/linuxdoom-1.10/i_system.c:    return (byte *) malloc (*size);
/home/hindle1/src/DOOM/linuxdoom-1.10/i_system.c:    mem = (byte *)malloc (length);
/home/hindle1/src/DOOM/linuxdoom-1.10/i_video.c:    				(char*)malloc(X_width * X_height),
/home/hindle1/src/DOOM/linuxdoom-1.10/i_video.c:	screens[0] = (unsigned char *) malloc (SCREENWIDTH * SCREENHEIGHT);
/home/hindle1/src/DOOM/linuxdoom-1.10/m_misc.c:		    newstring = (char *) malloc(len);
/home/hindle1/src/DOOM/linuxdoom-1.10/w_wad.c:#include &lt;malloc.h&gt;
/home/hindle1/src/DOOM/linuxdoom-1.10/w_wad.c:    lumpinfo = malloc(1);	
/home/hindle1/src/DOOM/linuxdoom-1.10/w_wad.c:    lumpcache = malloc (size);
/home/hindle1/src/DOOM/linuxdoom-1.10/z_zone.c:    // total bytes malloced, including header
</pre>

<p>
Turns out they pool allocate at the start and do their own memory management.
So they don't plan to call upon malloc very much after this point.
</p>

<div class="org-src-container">
<pre class="src src-sh">grep I_ZoneBase ~/src/DOOM/linuxdoom-1.10/*.h
grep I_ZoneBase ~/src/DOOM/linuxdoom-1.10/*.c
</pre>
</div>

<pre class="example">
/home/hindle1/src/DOOM/linuxdoom-1.10/i_system.h:byte*	I_ZoneBase (int *size);
/home/hindle1/src/DOOM/linuxdoom-1.10/i_system.c:byte* I_ZoneBase (int*	size)
/home/hindle1/src/DOOM/linuxdoom-1.10/z_zone.c:    mainzone = (memzone_t *)I_ZoneBase (&amp;size);
</pre></li>
</ul>



<ul class="org-ul">
<li><a href="file:///home/hindle1/src/DOOM/">~/src/DOOM/</a></li>
<li><a href="file:///home/hindle1/src/DOOM/linuxdoom-1.10/Makefile">~/src/DOOM/linuxdoom-1.10/Makefile</a></li>
<li><a href="file:///home/hindle1/src/DOOM/linuxdoom-1.10/i_main.c">~/src/DOOM/linuxdoom-1.10/i<sub>main.c</sub></a></li>
<li><a href="file:///home/hindle1/src/DOOM/linuxdoom-1.10/d_main.h">~/src/DOOM/linuxdoom-1.10/d<sub>main.h</sub></a></li>
</ul>
</div>
</div>
