week12/presentation.org
*** Refs
- DoomWiki contributors, 1999, Doom source code, https://doomwiki.org/wiki/Doom_source_code
- DoomWiki contributors, 1999, Doom source code files, https://doomwiki.org/wiki/Doom_source_code_files
- iD Software, 1997, Doom Source Code https://github.com/id-Software/DOOM/
- Fabien Sanglard, 2010, http://fabiensanglard.net/doomIphone/doomClassicRenderer.php
  - All about the engine itself
- Tom Hall, John Romero, 2011, Doom Postmortem
  https://www.gdcvault.com/play/1014627/Classic-Game-Postmortem
  - Developers discuss doom
- John Romero, 1993, A visit to iD Software, 
  https://www.youtube.com/watch?v=Q65xJfVkiaI
- Kris Occhipinti, 2015, Doom Source Code Editing Prboom GCC Linux Tutorial
   https://www.youtube.com/watch?v=Cd8T5-j1QwQ
   https://pastebin.com/T29s9Mss
