week12/presentation.html

<div id="outline-container-orgcd4b5d5" class="outline-4">
<h4 id="orgcd4b5d5"><span class="section-number-4">1.10.4</span> Refs</h4>
<div class="outline-text-4" id="text-1-10-4">
<ul class="org-ul">
<li>DoomWiki contributors, 1999, Doom source code, <a href="https://doomwiki.org/wiki/Doom_source_code">https://doomwiki.org/wiki/Doom_source_code</a></li>
<li>DoomWiki contributors, 1999, Doom source code files, <a href="https://doomwiki.org/wiki/Doom_source_code_files">https://doomwiki.org/wiki/Doom_source_code_files</a></li>
<li>iD Software, 1997, Doom Source Code <a href="https://github.com/id-Software/DOOM/">https://github.com/id-Software/DOOM/</a></li>
<li>Fabien Sanglard, 2010, <a href="http://fabiensanglard.net/doomIphone/doomClassicRenderer.php">http://fabiensanglard.net/doomIphone/doomClassicRenderer.php</a>
<ul class="org-ul">
<li>All about the engine itself</li>
</ul></li>
<li>Tom Hall, John Romero, 2011, Doom Postmortem
<a href="https://www.gdcvault.com/play/1014627/Classic-Game-Postmortem">https://www.gdcvault.com/play/1014627/Classic-Game-Postmortem</a>
<ul class="org-ul">
<li>Developers discuss doom</li>
</ul></li>
<li>John Romero, 1993, A visit to iD Software, 
<a href="https://www.youtube.com/watch?v=Q65xJfVkiaI">https://www.youtube.com/watch?v=Q65xJfVkiaI</a></li>
<li>Kris Occhipinti, 2015, Doom Source Code Editing Prboom GCC Linux Tutorial
<a href="https://www.youtube.com/watch?v=Cd8T5-j1QwQ">https://www.youtube.com/watch?v=Cd8T5-j1QwQ</a>
<a href="https://pastebin.com/T29s9Mss">https://pastebin.com/T29s9Mss</a></li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Abram Hindle</p>
<p class="date">Created: 2020-04-02 Thu 11:32</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
